import 'package:kafehfekr/Core/Resources/app_texts.dart';
import 'package:refreshed/get_navigation/src/root/internationalization.dart';

class AppTranslations extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'fa': {
          AppTexts.enterPhone: 'شماره همراه خود را وارد کنید',
          AppTexts.enterCode: 'کد دریافتی را وارد کنید',
          AppTexts.enterUsername: 'نام کاربری مورد نظر خود را وارد کنید',
          AppTexts.kafehfekrNarratie:
              'در تئاتر بزرگ بازی‌ها، هر چالش صحنه‌ای است که در آن استراتژی و شانس رقصی جاودانه را به نمایش می‌گذارند و هنر ذهن را در هر حرکت و انتخاب آشکار می‌کنند',
          AppTexts.timeoutError: 'دقایقی دیگر مجددا امتحان کنید',
          AppTexts.endGame: 'پایان بازی',
          AppTexts.endRound: 'پایان دور',
          AppTexts.gameDrawed: 'بازی مساوی شد',
          AppTexts.roundDrawed: 'این دور مساوی شد',
          AppTexts.youLoseGame: 'متاسفانه بازی رو باختی!',
          AppTexts.youLoseThisRound: 'این راند رو باختی!',
          AppTexts.youWinGame: 'تبریک برنده ی بازی شدی!',
          AppTexts.youWinThisRound: 'این راند رو بردی!',
          AppTexts.enemySurrenderGame: 'حریف تسلیم شد و پیروز شدی!',
          AppTexts.youSurrenderGame: 'تسلیم شدی و شکست خوردی!',
          AppTexts.wanaSurrenderGame: 'مطمئنی میخوای تسلیم شی؟',
          AppTexts.gameFinished: 'بازی تموم شده',
          AppTexts.stopPrevoiusQueue: 'جست و جوی قبلی رو متوقف کن',
          AppTexts.bombExploded: 'بمب ترکیده !',
          AppTexts.youOutOfMove: 'امکان حرکتی نداری!',
          AppTexts.enemyOutOfMove: 'حریف امکان حرکتی نداره!',
          AppTexts.normalGame: 'بازی دوستانه',
          AppTexts.rankGame: 'بازی رقابتی',
          AppTexts.surrender: 'تسلیم شدن',
          AppTexts.ok: 'بسیار خب',
          AppTexts.accept: 'تایید',
          AppTexts.win: 'برد',
          AppTexts.lose: 'باخت',
          AppTexts.draw: 'مساوی',
          AppTexts.cancel: 'نه بیخیالش',
          AppTexts.wait: 'منتظر بمانید ...',
          AppTexts.waitOpponent: 'منتظر حریف بمانید ...',
          AppTexts.outOfThisNumber: 'از این عدد دیگه نداری!',
          AppTexts.error: 'خطا',
          AppTexts.playGame: 'بازی کن',
          AppTexts.profile: 'حساب کاربری',
          AppTexts.ranking: 'رتبه بندی',
          AppTexts.gameMenu: 'بازی',
          AppTexts.clan: 'اتحاد',
          AppTexts.library: 'کتابخانه',
          AppTexts.settings: 'تنظیمات',
          AppTexts.howToPlay: 'نحوه ی انجام بازی',
          AppTexts.gamePlay: 'آموزش بازی',
          AppTexts.kafehFekr: 'کافه فکر(نسخه آزمایشی)',
          AppTexts.soon: 'بزودی ...',
          AppTexts.errorSolve: 'درست حل نکردی!',
          AppTexts.selectOneOption: 'یکی رو انتخاب کن',
          AppTexts.fillAllPieces: "همه ی خانه هارا پر کنید",
          AppTexts.rollDice: 'تاس بریز',
          AppTexts.showDice: 'نمایش تاس',
          AppTexts.notYourTurn: "نوبتت نیست!",
          AppTexts.cantSelect: "امکان انتخابشو نداری!",
          AppTexts.selectedBefore: "این خونه قبلاانتخاب شده!",
          AppTexts.selectedWrongPlace: 'جای اشتباهی انتخاب کردی!',
          AppTexts.selectAllShips: 'همه ی کشتی هارو قرار بده!',
          AppTexts.cantRemoveYourPiece: 'مهره خودتو نمیتونی حذف کنی!',
          AppTexts.cantRemoveThisPiece: 'این مهره رو نمیتونی حذف کنی',
          AppTexts.cantSwapEnemyPiece: 'بامهره حریف نمیتونی عوض کنی!',
          AppTexts.outOfDice: 'تاسی نمونده!',
          AppTexts.selectDiceFirst: 'تاستو انتخاب کن',
          AppTexts.bringInOutedPiece: 'مهره حذف شدتو بیارتو',
          AppTexts.selectNumber: 'یه عدد انتخاب کن',
          AppTexts.playerThisRound: 'این دست رو بازی کردی',
          AppTexts.yatzy1: 'تاس 1',
          AppTexts.yatzy2: 'تاس 2',
          AppTexts.yatzy3: 'تاس 3',
          AppTexts.yatzy4: 'تاس 4',
          AppTexts.yatzy5: 'تاس 5',
          AppTexts.yatzy6: 'تاس 6',
          AppTexts.yatzy33: '3 تایی',
          AppTexts.yatzy44: '4 تایی',
          AppTexts.yatzy23: 'فول هاوس',
          AppTexts.yatzy55: 'یاتزی',
          AppTexts.yatzy15: 'ردیف بزرگ',
          AppTexts.yatzy66: 'هرترکیب',
          AppTexts.tictactoe: 'تیک تاک تو',
          AppTexts.rpc: 'سنگ کاغذ قیچی',
          AppTexts.mill: 'دوز نه گانه',
          AppTexts.msweeper: 'مین یاب',
          AppTexts.mnumbers: 'کشف اعداد',
          AppTexts.chess: 'شطرنج',
          AppTexts.checkers: 'چکرز',
          AppTexts.ten: 'ده بساز',
          AppTexts.othello: 'اتللو',
          AppTexts.dotbox: 'نقطه خط',
          AppTexts.yatzy: 'یاتزی(پنج تاس)',
          AppTexts.fourInRow: 'دوزچهارتایی',
          AppTexts.sudoku: 'سودوکو',
          AppTexts.battleship: 'نبردکشتی',
          AppTexts.boxFour: 'چهارطرفه',
          AppTexts.backGammon: 'تخته نرد',
          AppTexts.tictactoeGameGuide: '''
با شروع بازی ، هر بازیکن در نوبت خود 10 ثانیه فرصت دارد که خانه ی مورد نظر خود را انتخاب کند.با یکبار زدن بر روی خانه ، آن خانه به تصاحب شما در می آید.
بازی در مجموع در 5 دور برگزار می شود و کسی که بیشترین تعداد دور را ببرد ، برنده ی بازی است.عدد اصلی بالای اسم بازیکن ، تعداد دور برنده شده را نمایش میدهد.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید.
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.rpcGameGuide: '''
با شروع بازی ، هر بازیکن 7 ثانیه فرصت دارد که سنگ ،کاغذ یا قیچی را انتخاب کرده و دکمه ی تایید را بزند.با یکبار زدن بر روی خانه ، آن حالت انتخاب می شود.توجه داشته باشید که دکمه ی تایید باید حتمازده شود وگرنه انتخاب شما ثبت نمی شود.
بازی در مجموع در 3 مرحله برگزار می شود که هر مرحله 5 دور است و کسی که بیشترین تعداد دور را ببرد ، برنده ی آن مرحله می شود.کسیکه بیشترین مرحله را ببرد ، برنده بازی است.
در گوشه ی اسم هر بازیکن ، تعداد مرحله های برنده شده توسط هر بازیکن نمایش داده میشود.همچنین عدد اصلی بالای اسم بازیکن ، تعداد دور برنده شده در این مرحله را نمایش میدهد.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.millGameGuide: '''
با شروع بازی ، هر بازیکن در نوبت خود 15 ثانیه فرصت دارد که خانه ی مورد نظر خود را انتخاب کند.با یکبار زدن بر روی خانه ، آن خانه به تصاحب شما در می آید.
درصورت به خط کردن 3 مهره و تشکیل دوز ، 10 ثانیه اجازه پیدا میکنید که یکی از مهره های حریف را انتخاب کرده و آن را حذف کنید.درصورت عدم حذف در این زمان ، این امکان شما می سوزد.
پس از اتمام مهره هایی که در بیرون بازی دارید ، نوبت به مرحله ی جابه جایی مهره ها می رسد.در نوبت خود 15 ثانیه فرصت دارین که مهره های خود را انتخاب کرده و به خانه ی خالی مجاور آن انتقال دهید.درصورت تشکیل دوز،قانون قبلی برقرار است.
در گوشه ی اسم هر بازیکن ، تعداد مهره هایی که هنوز وارد بازی نکرده نمایش داده میشود.همچنین عدد اصلی بالای اسم بازیکن ، تعداد مهره هایی که از حریف خارج کرده را نمایش میدهد.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید.
درصورتیکه بازیکن آنلاین باشد و بیش از 3 مرتبه نوبت خود را بازی نکند ، بازی را بازنده اعلام می شود.دربالای تصویر بازیکن ، تعداد دور هایی که بازی نکرده نمایش داده می شود.
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.msweeperGameGuide: '''
با شروع بازی ، هر بازیکن 10 دقیقه فرصت دارد که صفحه ی خود را از وجود بمب ها پاک کند.با یکبار زدن بر روی خانه ، عدد تعداد بمب های دور آن خانه به نمایش در می آید.درصورتیکه به اشتباه بمب را انتخاب کنید ، صفحه ی شما قفل می شود و امکان پیدا کردن مین بیشتر ندارید.
با نگه داشتن یک خانه ، آن خانه را بعنوان بمب در نظر میگیرید و میتوانید آن را خنثی کنید.درصورتیکه بدرستی این انتخاب را انجام دهید ، یک امتیاز به شما اضافه میشود.درصورتیکه به اشتباه این کار را انجام دهید ، یکی از امتیاز هایی که می توانید بگیرید میسوزد اما کماکان میتوانید به بازی ادامه دهید.
بازی در مجموع 10 بمب دارد و کسیکه زودتر این 10 بمب را پیدا کند و به امتیاز 10 برسد ، برنده است.عدد اصلی بالای اسم بازیکن ، تعداد بمبی که به درستی خنثی کرده نمایش داده می شود.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.فقط امیدوارم انقد بدشانس نباشید که اولین انتخابتان ، بمب باشد!! 
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.mnumbersGameGuide: '''
با شروع بازی ، هر بازیکن در نوبت خود 7 ثانیه فرصت دارد که دو خانه ی مورد نظر خود را انتخاب کند.با یکبار زدن بر روی دوخانه ، آن خانه به نمایش در می آید و در صورتیکه بدرستی حدس زده باشید ، امتیاز شما اضافه میشود.عدد اصلی بالای اسم بازیکن ، امتیاز او را نمایش میدهد.
بازی زمانی به اتمام می رسد که تمام خانه ها انتخاب شده باشند.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید.
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.chessGameGuide: '''
با شروع بازی ، هر بازیکن در نوبت خود 20 ثانیه فرصت دارد که خانه ی مورد نظر خود را انتخاب کرده و به مقصد هدایت کند.با یکبار زدن بر روی خانه ، آن خانه به انتخاب شما در می آید و می توانید آن را حرکت دهید.
درصورتیکه شاه شما کیش باشد ، دور آن قرمز می شود و تنها میتوانید حرکاتی انجام دهید که از کیش خارج شوید.اگر کیش باشید و شاه خود را به هر دلیل از کیش خارج نکنید ، بازیکن حریف میتواند شاه شما را مورد حمله قرار داده و بازی را ببرد.همچنین درصورتیکه امکان هیچگونه حرکتی نداشته باشید ، بازی را بازنده اعلام میشوید.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید.
درصورتیکه بازیکن آنلاین باشد و بیش از 3 مرتبه نوبت خود را بازی نکند ، بازی را بازنده اعلام می شود.دربالای تصویر بازیکن ، تعداد دور هایی که بازی نکرده نمایش داده می شود.
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.checkersGameGuide: '''
با شروع بازی ، هر بازیکن در نوبت خود 20 ثانیه فرصت دارد که خانه ی مورد نظر خود را انتخاب کرده و به مقصد هدایت کند.با یکبار زدن بر روی خانه ، آن خانه را انتخاب کرده و هدایت کنید.عدد اصلی بالای اسم بازیکن ، تعداد مهره هایی که از حریف حذف کرده را نمایش میدهد.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید.
درصورتیکه بازیکن آنلاین باشد و بیش از 3 مرتبه نوبت خود را بازی نکند ، بازی را بازنده اعلام می شود.دربالای تصویر بازیکن ، تعداد دور هایی که بازی نکرده نمایش داده می شود.
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.tenGameGuide: '''
با شروع بازی ، هر بازیکن در 300 ثانیه فرصت دارد که ده خود را تشکیل دهد.با فشردن هر عملگر یا عدد ، می توانید آن را در خانه ی مورد نظر خود قرار دهید.پس از ساخت 10 ، دکمه ی تایید را بزنید و دور را مال خود کنید.
بازی در مجموع در 3 دور برگزار می شود و کسی که بیشترین تعداد دور را ببرد ، برنده ی بازی است.عدد اصلی بالای اسم بازیکن ، تعداد دور برنده شده را نمایش میدهد.درهردور کسیکه زودتر مساله راحل کند،برنده ی دور است.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود. 
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.othelloGameGuide: '''
با شروع بازی ، هر بازیکن در نوبت خود 20 ثانیه فرصت دارد که خانه ی مورد نظر خود را انتخاب کند.با یکبار زدن بر روی خانه ، آن خانه را انتخاب کنید.عدد اصلی بالای اسم بازیکن ، تعداد مهره هایی که در صفحه دارد را نمایش میدهد.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید.درصورتیکه در نوبت خود مهره ی خود را بازی نکنید ، 
مهره ی شما می سوزد.
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.dotboxGameGuide: '''
با شروع بازی ، هر بازیکن در نوبت خود 15 ثانیه فرصت دارد که خط مورد نظر خود را انتخاب کند.با یکبار زدن بر روی خط ، آن خط را انتخاب کنید.عدد اصلی بالای اسم بازیکن ، تعداد خانه هایی که برای خود کردید را نمایش میدهد.درصورت ساخت خانه ، جایزه میگیرید و میتوانید مجددا خطی را انتخاب کنید.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید.
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.yatzyGameGuide: '''
با شروع بازی ، هر بازیکن 60 ثانیه فرصت دارد که انتخاب خود در دور فعلی را انجام دهد.با یکبار زدن روی یک تاس ، میتوانید آن را نگه دارید و سپس تاس بیندازید. درقسمت بالا ، خانه های اصلی بازی قرار دارد.با انتخاب خانه ای که قبلا انتخاب نکرده اید ، میتوانید آن خانه را برای دست فعلی خود انتخاب کرده و دکمه ی بازی کن را بزنید.بازی در مجموع 12 دور به تعداد 12 خانه دارد.
یکی از ستون ها نمایش دهنده ی خانه های شما و ستون دیگر نمایش دهنده ی خانه های حریف است.عدد اصلی بالای اسم بازیکن ، امتیاز بازیکن را نشان میدهد. درصورتیکه در دور فعلی به هر دلیلی خانه ای را انتخاب نکنید ، بازی به طور خودکار یک خانه را برای در دور فعلی شما ثبت میکند.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود. 
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.fourInRowGameGuide: '''
با شروع بازی ، هر بازیکن در نوبت خود 15 ثانیه فرصت دارد که ستون مورد نظر خود را انتخاب کند.با یکبار زدن بر روی خانه های بالای صفحه ، آن ستون را انتخاب کنید.عدد اصلی بالای اسم بازیکن ، تعداد مهره های باقیمانده بازیکن را نمایش میدهد.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید. 
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.sudokuGameGuide: '''
با شروع بازی ، هر بازیکن در 20 دقیقه فرصت دارد که سودوکوی خود را حل کند.با یکبار زدن بر روی اعداد پایین ، آن عدد را انتخاب کنید و یک بار زدن بر روی خانه های اعداد ، عدد موردنظر را جایگذاری کنید.
برای حذف یک عدد از جدول ،عدد انتخاب شده در پایین صفحه را با یکبار زدن انتخاب کرده و سپس برروی خانه ی مورد نظر در جدول بزنید.همچنین اگر عدد انتخابی شما با عدد قرار گرفته شده در آن خانه ی جدول یکی باشد، با یکبار زدن بر روی آن خانه ، عدد ازآن حذف میشود. 
پس از اتمام حل دکمه ی تایید را بزنید. بازیکنی که زودترجدول را حل کند برنده ی بازی است. 
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود. 
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.battleshipGameGuide: '''
با شروع بازی ، هر بازیکن 60 ثانیه فرصت دارد که کشتی های خود را جایگذاری کند.با یکبار زدن بر روی کشتی های پایین صفحه ، آن کشتی را انتخاب کنید.با نگه داشتن کشتی ، می توانید جهت آن را تغییر دهید.سپس بر روی یکی خانه ی جدول یک بار بزنید تا کشتی قرار بگیرد.وقتی تمامی کشتی ها را جایگذاری کردید،دکمه ی تایید را زده و منتظر حریف بمانید.درصورتیکه به هر دلیل بازیکن کشتی های خود را نچیند ، بازی به طور خودکار کشتی ها را به حالت پیش فرض بازی میچیند.
پس از اتمام فاز چینش ، مرحله ی اصلی بازی آغاز می شود.هر بازیکن در نوبت خود 12 ثانیه فرصت دارد یکی از خانه های حریف را با یکبار زدن بر روی آن مورد اصابت قرار دهد.درصورتیکه بدرستی این کار را انجام دهد، زمان ریست میشود و دوباره میتواند انتخاب کند.عدد اصلی بالای بازیکن ، نشان دهنده ی تعداد خانه هایی است که بدرستی مورداصابت قرار داده است.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید. 
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.boxFourGameGuide: '''
با شروع بازی ، هر بازیکن در نوبت خود 12 ثانیه فرصت دارد که خانه ی مورد نظر خود را انتخاب کند.با یکبار زدن بر روی خانه ، آن خانه راانتخاب کنید.عدد اصلی بالای اسم بازیکن ، تعداد خانه هایی که درتصرف دارد رانمایش میدهد.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید.
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.backGammonGameGuide: '''
با شروع بازی ، هر بازیکن در نوبت خود 30 ثانیه فرصت دارد که با زدن دکمه تاس بریز، تاس انداخته و بازی کند.پس از تاس ریختن ، تاس موردنظر خود را با یکبار زدن انتخاب کنید.سپس مهره ی مورد نظر خود را انتخاب کنید تا مهره انتقال یابد.
درصورتیکه مهره ای بیرون از بازی باشد ، پس از تاس ریختن و انتخاب تاس ، خانه ای که مهره ی بیرون میتواند به آن برود دارای حاشیه سفید میشود.با انتخاب آن خانه ، مهره ی بیرون وارد به آن خانه انتقال می یابد.
عدد اصلی بالای اسم بازیکن ، تعداد مهره هایی که بدرستی در انتهای بازی خارج کرده را نمایش میدهد.همچنین عدد پایین اسم بازیکن ، تعداد مهره هایی که بیرون از صفحه دارد و باید آن ها را به بازی برگرداند را نمایش میدهد.
در تایمر بالای صفحه ، زمان باقیمانده از مدت زمان ممکن برای انتخابتان نمایش داده می شود.همچنین اگر نوبت شما باشد ، تایمر به رنگ شما در بازی(قرمز یا آبی ) در می آید.درصورتیکه پس از تاس ریختن امکان هیچ حرکتی نداشته باشید ، نوبت شما می سوزد و نوبت حریف می شود.
درصورتیکه بازیکن آنلاین باشد و بیش از 3 مرتبه نوبت خود را بازی نکند ، بازی را بازنده اعلام می شود.دربالای تصویر بازیکن ، تعداد دور هایی که بازی نکرده نمایش داده می شود.
در صورت دیسکانکت شدن بازیکن به هر دلیل، بازیکن 120 ثانیه فرصت دارد تا به بازی برگردد.درصورت عدم بازگشت در این تایم ، بازی را بازنده اعلام شده و شکست میخورد.زمان باقیمانده برای برگشت وی در پایین اسم شخص نمایش داده می شود.
''',
          AppTexts.tictactoeGuide: '''
آماده‌سازی: این بازی روی یک جدول ۳×۳ انجام می‌شود. یکی از بازیکنان از "X" و دیگری از "O" استفاده می‌کند. بازیکنان به نوبت یکی از خانه‌های خالی را علامت‌گذاری می‌کنند.

هدف:
 هدف این است که اولین کسی باشید که سه علامت خود (X یا O) را در یک ردیف، ستون، یا قطر قرار دهد.

نحوه بازی:
بازیکن اول بازی را با قرار دادن علامت خود در یکی از خانه‌های خالی شروع می‌کند.
بازیکن دوم سپس علامت خود را در یکی از خانه‌های خالی باقی‌مانده قرار می‌دهد.
بازی به همین ترتیب ادامه می‌یابد و بازیکنان به نوبت تلاش می‌کنند تا یک خط سه‌تایی از علامت‌های خود ایجاد کرده و در عین حال مانع از ایجاد خط سه‌تایی توسط حریف شوند.

پیروزی در بازی:
 بازیکنی برنده می‌شود که سه علامت خود را در یک ردیف افقی، عمودی، یا قطری قرار دهد. اگر هر ۹ خانه پر شود و هیچ بازیکنی موفق به انجام این کار نشود، بازی مساوی می‌شود.

پایان بازی:
 وقتی یکی از بازیکنان سه‌تایی کند یا تمام خانه‌ها پر شود، بازی به پایان می‌رسد.
''',
          AppTexts.rpcGuide: '''
آماده‌سازی:
 بازی سنگ، کاغذ، قیچی یک بازی دستی ساده است که معمولاً بین دو نفر انجام می‌شود. هر بازیکن به‌طور همزمان یکی از سه شکل را با دست خود می‌سازد: سنگ (دست مشت‌شده)، کاغذ (دست باز) یا قیچی (دست مشت‌شده با انگشت شست و اشاره باز).

هدف:
 هدف این است که شکلی انتخاب کنید که بر شکل حریف پیروز شود طبق قوانین بازی.
سنگ قیچی را می‌شکند (سنگ برنده است)
قیچی کاغذ را می‌برد (قیچی برنده است)
کاغذ سنگ را می‌پوشاند (کاغذ برنده است)
اگر هر دو بازیکن شکل یکسانی را انتخاب کنند، بازی مساوی می‌شود.

پیروزی در بازی:
 بازیکنی که شکل برنده را بر اساس قوانین انتخاب کند، برنده آن دور است. اگر بازی به‌صورت چندین دور انجام شود، بازیکنی که بیشترین تعداد برد را داشته باشد، برنده نهایی است.

پایان بازی:
 بازی پس از تعداد مشخصی از دورها یا وقتی که بازیکنی به تعداد معینی از بردها برسد، به پایان می‌رسد.''',
          AppTexts.millGuide: '''
صفحه بازی:
 بازی بر روی صفحه‌ای با سه مربع هم‌مرکز که به وسیله خطوط به هم متصل شده‌اند و ۲۴ نقطه تقاطع تشکیل می‌دهد، انجام می‌شود.
 هر بازیکن دارای10  قطعه با رنگ مشخص است.

هدف:
هدف این است که "دوز" (سه قطعه از رنگ خود که در یک ردیف قرار گرفته‌اند) بسازید و قطعات حریف را به دو عدد کاهش دهید.

نحوه بازی:
مرحله قراردهی:
بازیکنان به نوبت قطعات خود را بر روی نقاط خالی صفحه قرار می‌دهند.
هدف در این مرحله این است که قطعات خود را به‌گونه‌ای قرار دهید که دستگاه بسازید و از ساخت دستگاه توسط حریف جلوگیری کنید.

مرحله حرکت:
پس از پایان قراردهی قطعات، بازیکنان نوبتی قطعات خود را جابجا می‌کنند.
هر قطعه می‌تواند به هر نقطه خالی مجاور در امتداد خطوط متصل به مربع‌ها حرکت کند.
ساخت دستگاه به شما این امکان را می‌دهد که یکی از قطعات حریف را از صفحه بازی بردارید.

دوز شدن :
دستگاه زمانی ساخته می‌شود که سه قطعه از رنگ خود را در یک ردیف در امتداد یکی از خطوط قرار دهید.
هر بار که دستگاه بسازید، می‌توانید یکی از قطعات حریف را از صفحه بردارید.

برنده بازی:
بازی زمانی پایان می‌یابد که یک بازیکن قطعات حریف را به دو عدد کاهش دهد، به‌گونه‌ای که حریف نتواند دستگاه بسازد یا به‌طور مؤثر حرکت کند.
''',
          AppTexts.msweeperGuide: '''
صفحه بازی:
 مین‌یاب بر روی یک شبکه از مربع‌ها بازی می‌شود که اندازه آن بسته به سطح دشواری متفاوت است . برخی از مربع‌ها شامل مین‌های پنهان هستند.
هدف:
 هدف این است که بدون انفجار مین‌ها، تمام مربع‌های غیر مین را پاک‌سازی کنید.

نحوه بازی:
افشای مربع‌ها:
وقتی روی یک مربع کلیک می‌کنید، یکی از سه اتفاق می‌افتد:
مربع خالی: مربع باز می‌شود و عدد یا فضای خالی را نشان می‌دهد. عدد نشان‌دهنده تعداد مین‌های موجود در مربع‌های مجاور است.
مربع شماره‌دار: عددی (۱-۸) را نشان می‌دهد که تعداد مین‌های مجاور را مشخص می‌کند. از این اطلاعات برای حدس محل مین‌ها استفاده کنید.
مین: اگر بر روی مربع دارای مین کلیک کنید، بازی با انفجار مین به پایان می‌رسد.
پاک‌سازی صفحه:
به افشای مربع‌ها بر اساس اعداد و مین‌های علامت‌گذاری‌شده ادامه دهید. از استدلال منطقی برای تعیین کدام مربع‌ها ایمن هستند استفاده کنید.
اگر تمام مربع‌های مین دار را تشخیص دهید، بازی را برنده می‌شوید.

استراتژی‌های پیشرفته:
شناسایی الگوها: الگوها و استراتژی‌های رایج را یاد بگیرید تا مربع‌های ایمن را سریع‌تر شناسایی کنید.
مدیریت ریسک: در مواقعی که نتایج نامشخص هستند، با توجه به اطلاعات موجود، ریسک کلیک بر روی مربع‌های خاص را بسنجید.
با دقت در افشای مربع‌ها و استراتژی درست در علامت‌گذاری مین‌ها، می‌توانید در صفحه حرکت کرده و بدون منفجر کردن مین‌های پنهان پیروز شوید.
''',
          AppTexts.mnumbersGuide: '''

قطعات:
 ۳۶ قطعه دارید که هرکدام دارای عددی هستند. ۱۸ عدد منحصر به فرد وجود دارد و هر عدد بر روی دو قطعه نمایان شده است.
هدف:
 هدف این است که جفت‌های قطعاتی که عدد یکسانی دارند را پیدا کنید.

نحوه بازی:
چیدن قطعات: تمام ۳۶ قطعه  به صورت تصادفی در یک الگوی ۶×۶ قرار میگیرند.
نوبت‌ها:
بازیکنان به نوبت دو قطعه را برمی‌گردانند تا تلاش کنند جفت مشابهی پیدا کنند.
وقتی بازیکن دو قطعه را برمی‌گرداند، اعداد روی آن‌ها نمایان می‌شود.
پیدا کردن جفت‌ها:
اگر دو قطعه عدد مشابهی را نشان دهند، بازیکن آن جفت را نگه می‌دارد.
اگر اعداد مطابقت نداشته باشند، قطعات دوباره به حالت رو به پایین برگردانده می‌شود و نوبت به بازیکن بعدی می‌رسد.
یادآوری مکان‌ها:
بازیکنان باید موقعیت اعداد قبلاً نمایان شده را به خاطر بسپارند تا شانس یافتن جفت‌ها را افزایش دهند.

برنده بازی:
بازی تا زمانی ادامه می‌یابد که تمام جفت‌ها شناسایی و جمع‌آوری شوند.
بازیکنی که بیشترین تعداد جفت‌ها را در پایان بازی جمع‌آوری کرده باشد، برنده است.
''',
          AppTexts.chessGuide: '''
1. آماده‌سازی:
صفحه بازی:
 شطرنج بر روی صفحه‌ای ۸×۸ از مربع‌های روشن و تاریک بازی می‌شود.
قطعات: هر بازیکن با ۱۶ قطعه آغاز می‌کند: ۱ شاه، ۱ وزیر، ۲ قلعه، ۲ اسب، ۲ فیل و ۸ پیاده.
ردیف عقب (از چپ به راست): قلعه، اسب، فیل، وزیر، شاه، فیل، اسب، قلعه.
ردیف جلو: تمام ۸ پیاده.

2. هدف:
هدف اصلی، کیش و مات کردن شاه حریف است، به این معنی که شاه در وضعیتی قرار گیرد که تحت تهدید گرفتن باشد و نتواند فرار کند.

3. قوانین و حرکات اصلی:
شاه: به یک مربع در هر جهت-افقی، عمودی، یا قطری-حرکت می‌کند.
وزیر: به هر تعداد مربع در هر جهت-افقی، عمودی، یا قطری-حرکت می‌کند.
قلعه: به هر تعداد مربع به‌صورت افقی یا عمودی حرکت می‌کند.
فیل: به هر تعداد مربع به‌صورت قطری حرکت می‌کند.
اسب: به شکل L حرکت می‌کند: دو مربع در یک جهت و سپس یک مربع در جهت عمود بر آن. اسب تنها قطعه‌ای است که می‌تواند از روی قطعات دیگر بپرد.
پیاده: به جلو یک مربع حرکت می‌کند و به‌صورت قطری می‌زند. در اولین حرکت، پیاده می‌تواند دو مربع به جلو حرکت کند. پیاده‌ها می‌توانند با رسیدن به انتهای مخالف صفحه، به وزیر ارتقا یابند.

4. حرکات ویژه:
قلعه‌گذاری: حرکتی است که شامل شاه و یکی از قلعه‌ها می‌شود. شاه دو مربع به سمت قلعه حرکت می‌کند و قلعه به مربع کناری شاه می‌رود. شرایط: نه شاه و نه قلعه نباید قبلاً حرکت کرده باشند، مربع‌های بین آن‌ها باید خالی باشد و شاه نباید تحت حمله یا در حال عبور از مربع‌های تحت حمله حریف باشد.
ارتقای پیاده: وقتی پیاده به انتهای مخالف صفحه می‌رسد، می‌تواند به وزیر ارتقا یابد.

5. کیش و مات:
کیش: زمانی که شاه تحت تهدید مستقیم گرفتن است. بازیکن باید حرکتی انجام دهد که تهدید را برطرف کند.
مات: زمانی که شاه تحت کیش است و هیچ حرکت قانونی نمی‌تواند تهدید را برطرف کند. بازی با شکست بازیکن مات شده به پایان می‌رسد.

6. پایان بازی:
بازی زمانی به پایان می‌رسد که یکی از بازیکنان شاه حریف را کیش و مات کند، حریف استعفا دهد، یا یکی از شرایط تساوی برآورده شود.
در شطرنج، استراتژی، پیش‌بینی و توانایی پیش‌بینی حرکات حریف برای موفقیت حیاتی است.
''',
          AppTexts.checkersGuide: '''
۱. آماده‌سازی:
صفحه بازی:
 این بازی بر روی صفحه‌ای ۸×۸ با مربع‌های روشن و تاریک بازی می‌شود. تنها مربع‌های تاریک برای حرکت و گرفتن قطعات استفاده می‌شوند.
قطعات: هر بازیکن با ۱۲ قطعه شروع می‌کند که به آنها "مرد" گفته می‌شود. یک بازیکن از قطعات تیره و دیگری از قطعات روشن استفاده می‌کند.
چیدمان اولیه: قطعات  بر روی سه ردیف نزدیک به هر بازیکن قرار می گیرد. قطعات هر بازیکن بر روی مربع‌های تاریک این ردیف‌ها قرار می‌گیرند.

۲. هدف:
هدف بازی این است که تمامی قطعات حریف را بگیرید یا آنها را مسدود کنید تا نتوانند حرکتی قانونی انجام دهند.

۳. قوانین و حرکات اصلی:
حرکت‌ها:
مردها: به صورت قطری و یک مربع به جلو حرکت می‌کنند.
شاه: وقتی قطعه‌ای به آخرین ردیف حریف برسد، به شاه تبدیل می‌شود و می‌تواند به صورت قطری و به جلو و عقب، هر تعداد مربع را بپوشاند.

گرفتن:
گرفتن پایه‌ای: برای گرفتن قطعه حریف، باید به صورت قطری از روی آن بپرید و به مربع خالی درست در پشت آن فرود آیید. قطعه گرفته شده از صفحه حذف می‌شود.
گرفتن‌های متوالی: اگر یک قطعه قادر به انجام چندین گرفتن در یک نوبت باشد، باید به گرفتن ادامه دهد.
ارتقا: وقتی یک مرد به آخرین ردیف حریف برسد، به شاه ارتقا می‌یابد و با قرار دادن قطعه دیگری روی آن تاج‌گذاری می‌شود.

۴. قوانین ویژه:
پرش مضاعف: اگر یک قطعه بتواند چندین گرفتن در یک نوبت انجام دهد، باید به گرفتن ادامه دهد.
پرش از روی قطعات خود: یک بازیکن نمی‌تواند از روی قطعات خود بپرد.

5. پایان بازی:
بازی زمانی به پایان می‌رسد که یکی از بازیکنان تمام قطعات حریف را بگیرد یا زمانی که هیچ یک از بازیکنان نتوانند حرکتی قانونی انجام دهند و بازی به تساوی می‌انجامد.
در این بازی، حرکت استراتژیک و برنامه‌ریزی دقیق کلیدی است، زیرا بازیکنان باید حرکات حریف را پیش‌بینی کنند و در عین حال برای شکست آنها نقشه‌ریزی کنند.
''',
          AppTexts.tenGuide: '''
بازی "ده بساز" یک معمای ریاضی است که در آن بازیکنان چهار عدد می‌گیرند و باید با استفاده از عملگرهای ریاضی (جمع، تفریق، ضرب و تقسیم) آن اعداد را طوری ترکیب کنند که به عدد ۱۰ برسند. این بازی نیازمند تفکر خلاقانه، درک عملیات ریاضی و گاهی اندکی آزمون و خطا است.

قوانین بازی:
هدف:
 از هر چهار عدد و ترکیبی از عملگرهای ریاضی (+، −، ×، ÷) استفاده کنید تا یک عبارت بسازید که دقیقاً برابر با ۱۰ باشد.
اعداد: به بازیکن چهار عدد داده می‌شود. به عنوان مثال: [۲، ۳، ۵، ۷].

عملگرها:
 می‌توانید از چهار عملیات اصلی ریاضی استفاده کنید:
جمع (+)
تفریق (−)
ضرب (×)
تقسیم (÷)

استفاده از اعداد:
هر چهار عدد باید دقیقاً یک بار استفاده شوند.
ترتیب استفاده از اعداد می‌تواند تغییر کند.

تشکیل عبارات:
بازیکنان می‌توانند اعداد و عملگرها را به هر شکلی که بخواهند ترکیب کنند. به عنوان مثال: (۲ + ۳) × (۷ − ۵).
می‌توان از پرانتزها برای کنترل ترتیب عملیات استفاده کرد.

ترکیب نکردن اعداد:
نمی‌توانید اعداد را برای تشکیل عدد جدید به هم بچسبانید (مثلاً ترکیب ۲ و ۳ برای ساختن ۲۳ مجاز نیست).
نتیجه معتبر: عبارت نهایی باید دقیقاً برابر با ۱۰ باشد. تقریبی‌ها یا اعداد اعشاری مجاز نیستند؛ راه‌حل باید دقیقاً عدد صحیح باشد.

مثال از بازی:
اعداد نمونه: [۲، ۳، ۵، ۷]
گام ۱: به دنبال ترکیب‌هایی از اعداد بگردید که بتوانند با جمع، تفریق، ضرب یا تقسیم به ۱۰ برسند.
به عنوان مثال، با ۲ و ۳ شروع کنید. جمع آنها ۵ می‌شود.

گام ۲: عدد بعدی را در نظر بگیرید. اگر ۵ (از مجموعه اولیه) را اضافه کنیم، ۱۰ می‌شود.
اما هنوز عدد ۷ را باید استفاده کنیم. سعی کنید (۷ - ۵) را به ۲ تبدیل کنید.

گام ۳: مراحل را ترکیب کنید تا عبارت کامل شود:
(۲ + ۳) + (۷ - ۵) = ۱۰.
بنابراین، عبارت نهایی این است:
(۲+۳)+(۷−۵)=۱۰

نکات و استراتژی‌ها:
پیش‌نگری کنید: تأثیر هر عملگر و ترتیب عملیات را در نظر بگیرید. ضرب و تقسیم تأثیر بیشتری بر نتیجه دارند نسبت به جمع و تفریق.
با ترکیب‌های مختلف آزمایش کنید: اگر یک روش کار نکرد، اعداد را جابجا کنید یا ترکیب دیگری از عملیات را امتحان کنید.
از پرانتزها به درستی استفاده کنید: پرانتزها به کنترل ترتیب عملیات کمک می‌کنند و می‌توانند اعداد را برای رسیدن به نتیجه دلخواه گروه‌بندی کنند.
با مجموعه‌های مختلف تمرین کنید: هرچه بیشتر تمرین کنید، بیشتر با شناسایی ترکیب‌هایی که به راه‌حل منجر می‌شوند آشنا می‌شوید.

پایان بازی:
بازی زمانی به پایان می‌رسد که بازیکن با موفقیت عبارتی ایجاد کند که با استفاده از هر چهار عدد برابر با ۱۰ باشد. بازیکنان می‌توانند رقابت کنند تا ببینند چه کسی سریع‌تر معما را حل می‌کند یا چه کسی بیشترین راه‌حل‌های منحصربه‌فرد را پیدا می‌کند.
این بازی روشی سرگرم‌کننده برای تقویت مهارت‌های ریاضی، افزایش توانایی‌های حل مسئله و لذت بردن از یک چالش ذهنی است!
''',
          AppTexts.othelloGuide: '''
اتللو، که به نام ریورسی نیز شناخته می‌شود، یک بازی استراتژی دو نفره است که هدف آن داشتن بیشترین تعداد مهره‌های رنگ خود روی صفحه تا پایان بازی است. این بازی روی صفحه‌ای ۸×۸ با استفاده از مهره‌های دو طرفه (یک طرف سیاه و طرف دیگر سفید) انجام می‌شود.

نحوه راه‌اندازی بازی:
صفحه بازی: بازی روی یک صفحه مربعی ۸×۸ انجام می‌شود.
مهره‌ها: هر بازیکن از ۳۲ مهره استفاده می‌کند. یک طرف هر مهره سیاه و طرف دیگر آن سفید است.
موقعیت شروع: دو مهره سیاه را روی خانه‌های D5 و E4 و دو مهره سفید را روی خانه‌های D4 و E5 در مرکز صفحه قرار می گیرند.

هدف بازی:
هدف این است که بازی را با بیشترین تعداد مهره‌های رنگ خود به پایان برسانید.

قوانین بازی:
نوبت‌ها:
بازیکنان به نوبت یک مهره از رنگ خود را روی صفحه قرار می‌دهند.

محاصره کردن:
یک حرکت معتبر باید یک یا چند مهره حریف را محاصره کند.
محاصره کردن به این معناست که مهره‌ای را طوری قرار دهید که یک خط از مهره‌های حریف بین دو مهره شما در یک خط مستقیم (افقی، عمودی یا مورب) قرار گیرد.

برگرداندن مهره‌ها:
پس از قرار دادن مهره، همه مهره‌های محاصره‌شده حریف به رنگ بازیکن برگردانده می‌شوند.
در یک حرکت می‌توان خطوط متعددی از مهره‌ها را برگرداند.

حرکات معتبر:
اگر بازیکنی حرکات معتبری نداشته باشد که منجر به برگرداندن مهره‌ها شود، باید نوبت خود را بگذراند.
اگر هیچ‌یک از بازیکنان نتوانند حرکتی انجام دهند، بازی به پایان می‌رسد.

پایان بازی:
بازی زمانی به پایان می‌رسد که هیچ‌یک از بازیکنان نتوانند حرکت معتبری انجام دهند، معمولاً وقتی که صفحه پر می‌شود.

بازیکنی که بیشترین مهره‌های رنگ خود را روی صفحه داشته باشد، برنده است.

استراتژی‌های پایه:
کنترل گوشه‌ها: موقعیت‌های گوشه را تصاحب کنید، زیرا این مهره‌ها دائمی هستند و نمی‌توان آن‌ها را برگرداند.
اجتناب از دادن گوشه‌ها: مراقب حرکت‌هایی باشید که به حریف دسترسی آسان به گوشه‌ها می‌دهد.
کنترل لبه‌ها: کنترل لبه‌ها می‌تواند مزیت‌های استراتژیکی فراهم کرده و حرکات حریف را محدود کند.
اتللو بازی‌ای است از تاکتیک و برنامه‌ریزی، جایی که هر حرکت می‌تواند جریان بازی را تغییر دهد. این بازی ترکیبی از سادگی و عمق استراتژیک است که آن را به یک بازی کلاسیک برای همه سنین تبدیل کرده است.
''',
          AppTexts.dotboxGuide: '''
"نقطه و جعبه" یک بازی کلاسیک کاغذ و قلم برای دو نفر است. هدف بازی این است که بیشتر از حریف، جعبه‌ها را با وصل کردن نقاط با خطوط کامل کنید.

بازیکنان:
دو بازیکن به نوبت بازی می‌کنند. و در نوبت خود یک خط را انتخاب می کنند.

هدف:
هدف این است که با کشیدن ضلع چهارم یک جعبه ۱×۱، جعبه‌های بیشتری نسبت به حریف خود تکمیل کنید.

قوانین بازی:
کشیدن خطوط:
بازیکنان به نوبت یک خط افقی یا عمودی بین دو نقطه مجاور می‌کشند.
خطوط باید روی شبکه کشیده شوند و فقط دو نقطه مجاور را به هم وصل کنند.

تکمیل یک جعبه:
زمانی که بازیکنی خطی می‌کشد که ضلع چهارم یک جعبه ۱×۱ را کامل می‌کند، آن جعبه را "تسخیر" می‌کند.
سپس بازیکن با علامت خود یا رنگ خود آن جعبه را مشخص کرده و یک نوبت اضافی دریافت می‌کند.

نوبت‌های اضافی:
اگر تکمیل یک جعبه منجر به امکان تکمیل جعبه دیگری شود، بازیکن به کشیدن خطوط ادامه می‌دهد تا زمانی که دیگر جعبه‌ای برای تکمیل نباشد.

بازی استراتژیک:
بازیکنان تلاش می‌کنند تا از ایجاد موقعیت‌هایی که به حریف اجازه تکمیل جعبه را می‌دهد، جلوگیری کنند.
کلید موفقیت این است که فرصت‌هایی برای تسخیر چندین جعبه در یک نوبت ایجاد کنید.

پایان بازی:
بازی زمانی به پایان می‌رسد که همه خطوط ممکن کشیده شده و همه جعبه‌ها تکمیل شده باشند.

برنده بازی:
بازیکنی که بیشترین جعبه‌های تکمیل شده را داشته باشد، برنده بازی است.

استراتژی‌های پایه:
اجتناب از کشیدن ضلع سوم: سعی کنید ضلع سوم یک جعبه را نکشید، زیرا این کار به حریف اجازه می‌دهد در نوبت بعدی آن را تکمیل کند.

ایجاد زنجیره‌ها: به دنبال فرصت‌هایی برای ایجاد زنجیره‌هایی از جعبه‌ها باشید که بتوانید همه را یکجا تسخیر کنید.

مجبور کردن حریف: موقعیت‌هایی ایجاد کنید که حریف را مجبور به دادن چندین جعبه به شما در نوبت خودتان کند.

"نقطه و جعبه" یک بازی با برنامه‌ریزی دقیق و استراتژی است که هر خط کشیده شده می‌تواند جریان بازی را تغییر دهد. با قوانین ساده و تاکتیک‌های عمیق، این بازی به یک بازی بی‌زمان تبدیل شده که ذهن را به چالش می‌کشد و بازیکنان در هر سنی را سرگرم می‌کند.
''',
          AppTexts.yatzyGuide: '''
یاتزی یک بازی محبوب تاس است که ترکیبی از شانس و استراتژی را ارائه می‌دهد. این بازی با پنج تاس و یک برگه امتیاز انجام می‌شود و بازیکنان تلاش می‌کنند تا با انداختن ترکیب‌های خاص، بیشترین امتیاز ممکن را به دست آورند.

نحوه راه‌اندازی بازی:
بازیکنان: یاتزی را می‌توان با دو یا چند بازیکن بازی کرد.

هدف بازی:
هدف این است که با انداختن ترکیب‌های خاص با تاس‌ها در 12 دور، بیشترین امتیاز را کسب کنید.

قوانین بازی:
انداختن تاس‌ها:
در هر نوبت، یک بازیکن می‌تواند تا چهار بار تاس‌  بیندازد.
بعد از هر بار انداختن، بازیکن می‌تواند هر تعداد از تاس‌هایی که می‌خواهد نگه دارد و باقی تاس‌ها را دوباره بیندازد. بازیکن می‌تواند این کار را تا سه بار دیگر تکرار کند (مجموعاً چهار بار انداختن در هر نوبت).

انتخاب یک دسته:
پس از انداختن چهارم، یا اگر بازیکن زودتر تصمیم به توقف بگیرد، باید یکی از دسته‌های موجود در برگه امتیاز را برای ثبت امتیاز انتخاب کند.

دسته‌ها به دو بخش تقسیم می‌شوند: بخش بالا و بخش پایین.

امتیازدهی در بخش بالا:
بخش بالا شامل ترکیب‌های امتیازدهی برای هر وجه تاس (یک‌ها، دوها، سه‌ها، و غیره) است.
بازیکنان مجموع شماره‌های مربوطه را که انداخته‌اند ثبت می‌کنند (مثلاً اگر سه عدد پنج بیندازید، ۱۵ امتیاز در دسته "پنج‌ها" کسب می‌کنید).
اگر بازیکن حداقل ۶۳ امتیاز در بخش بالا کسب کند، ۳۵ امتیاز اضافی دریافت می‌کند.
امتیازدهی در بخش پایین:

بخش پایین شامل ترکیب‌های مختلفی است مانند:
سه‌تایی: سه تاس که یک عدد را نشان می‌دهند. امتیاز، مجموع همه تاس‌ها است.
چهارتایی: چهار تاس که یک عدد را نشان می‌دهند. امتیاز، مجموع همه تاس‌ها است.
فول‌هاوس: سه‌تایی و یک جفت. ۲۵ امتیاز.
ردیف بزرگ: پنج عدد متوالی (مثلاً ۲-۳-۴-۵-۶). ۴۰ امتیاز.
یاتزی: پنج تاس یکسان. ۵۰ امتیاز.
شانس: هر ترکیبی. امتیاز، مجموع همه تاس‌ها است.

پایان بازی:
بازی پس از 12 دور، زمانی که همه دسته‌ها در برگه امتیاز پر شده باشند، به پایان می‌رسد.
بازیکنان امتیازات خود را از بخش‌های بالا و پایین جمع می‌کنند تا به امتیاز نهایی برسند.

برنده بازی:
بازیکنی که در پایان بازی بیشترین امتیاز کل را دارد، برنده است.

استراتژی‌ها:
تعادل بین ریسک و پاداش: تصمیم بگیرید که چه زمانی برای ترکیب‌های پرخطر مانند یاتزی اقدام کنید و چه زمانی به گزینه‌های امن‌تر مانند شانس بروید.

پاداش بخش بالا: سعی کنید با اولویت دادن به بخش بالا در اوایل بازی، پاداش ۳۵ امتیازی را کسب کنید.

استراتژی انعطاف‌پذیر: آماده باشید تا با توجه به آنچه که می‌اندازید و دسته‌های باقیمانده، استراتژی خود را تطبیق دهید.

یاتزی بازی‌ای است از شانس، انتخاب، و استراتژی که با هر انداختن تاس هیجان ایجاد می‌کند و بازیکنان را به تفکر وادار می‌کند تا امتیازات خود را به حداکثر برسانند.
''',
          AppTexts.fourInRowGuide: '''
"چهار در ردیف" یک بازی دو نفره است که هدف آن این است که اولین نفری باشید که چهار دیسک از خود را به صورت افقی، عمودی یا قطری در یک ردیف قرار دهید. این بازی روی یک شبکه عمودی انجام می‌شود و به خاطر سادگی و عمق استراتژیکش شناخته شده است.

نحوه راه‌اندازی بازی:
بازیکنان: دو بازیکن با یکدیگر رقابت می‌کنند.

هدف بازی:
هدف این است که اولین بازیکنی باشید که چهار دیسک از خود را به صورت افقی، عمودی یا قطری در یک ردیف قرار دهید.

قوانین بازی:
نوبت‌ها
بازیکنان به نوبت یک دیسک از خود را در یکی از ستون ها قرار می‌دهند.
دیسک به پایین‌ترین فضای در دسترس در ستون انتخابی می‌افتد.

برنده شدن بازی:
اولین بازیکنی که چهار دیسک از خود را به صورت افقی، عمودی یا قطری در یک ردیف قرار دهد، برنده بازی است.
بازی زمانی به پایان می‌رسد که یک بازیکن این اتصال را به دست آورد یا زمانی که همه ستون‌ها پر شده و هیچ بازیکنی برنده نشده باشد (در نتیجه بازی به تساوی می‌انجامد).

استراتژی و بلوک کردن:
بازیکنان باید به دنبال ایجاد اتصالات چهار دیسکی خود باشند و همچنین از تلاش‌های حریف برای رسیدن به همان هدف جلوگیری کنند.
بازی استراتژیک شامل حرکات تهاجمی برای ایجاد اتصال و حرکات تدافعی برای جلوگیری از پیروزی حریف است.
پایان بازی:
بازی زمانی به پایان می‌رسد که یک بازیکن چهار دیسک در یک ردیف متصل کند یا زمانی که تمام فضاهای شبکه پر شده و هیچ بازیکنی برنده نشده باشد، که منجر به تساوی می‌شود.

استراتژی‌های پایه:
کنترل مرکز: سعی کنید دیسک‌های خود را در ستون‌های مرکزی قرار دهید، زیرا این کار فرصت‌های بیشتری برای ایجاد اتصالات فراهم می‌کند.
توجه به فرصت‌ها: به دنبال فرصت‌هایی برای ایجاد اتصالات چندگانه برنده به طور همزمان باشید.
مسدود کردن حریف: همیشه به دنبال حرکات بالقوه برنده حریف باشید و در صورت لزوم، آن‌ها را مسدود کنید.
"چهار در ردیف" بازی‌ای با عمق تاکتیکی است که هر حرکت می‌تواند به پیروزی یا شکست منجر شود. قوانین ساده این بازی به همراه امکانات استراتژیک، آن را به یک کلاسیک بی‌زمان تبدیل کرده که توسط بازیکنان در هر سنی لذت بخش است.
''',
          AppTexts.sudokuGuide: '''
سودوکو یک بازی محبوب پازلی مبتنی بر منطق است که شامل پر کردن یک جدول ۹x۹ با اعداد می‌شود. هدف این است که جدول را طوری پر کنید که هر ستون، هر ردیف، و هر یک از نه زیرشبکه ۳x۳ (که "باکس" هم نامیده می‌شوند) حاوی تمام اعداد از ۱ تا ۹ باشد، بدون این‌که هیچ عددی تکرار شود.

راه‌اندازی بازی:
جدول سودوکو از ۸۱ خانه تشکیل شده است که در قالب ۹x۹ چیده شده‌اند.
جدول به نه زیرشبکه ۳x۳ نیز تقسیم می‌شود.
برخی از خانه‌ها با اعداد از پیش پر شده‌اند که به عنوان سرنخ‌هایی برای حل پازل عمل می‌کنند. درجه سختی پازل به تعداد و محل قرارگیری این اعداد پیش‌فرض بستگی دارد.
هدف:
هدف سودوکو این است که کل جدول ۹x۹ را با اعداد ۱ تا ۹ پر کنید. هر عدد باید فقط یک بار در هر ردیف، ستون و زیرشبکه ۳x۳ ظاهر شود.

قوانین بازی:
پر کردن جدول:
ابتدا جدول را بررسی کنید و ردیف‌ها، ستون‌ها یا زیرشبکه‌هایی که تعدادی از اعداد در آنها پر شده‌اند شناسایی کنید. این‌ها سرنخ‌های شما هستند.
از منطق برای تعیین اعدادی که می‌توانند در خانه‌های خالی قرار گیرند استفاده کنید و قوانین زیر را رعایت کنید:
قانون ۱: هر عدد از ۱ تا ۹ باید دقیقاً یک بار در هر ردیف ظاهر شود.
قانون ۲: هر عدد از ۱ تا ۹ باید دقیقاً یک بار در هر ستون ظاهر شود.
قانون ۳: هر عدد از ۱ تا ۹ باید دقیقاً یک بار در هر زیرشبکه ۳x۳ ظاهر شود.

استفاده از حذف:
هر ردیف، ستون و زیرشبکه را بررسی کنید تا مشخص کنید کدام اعداد در آنجا وجود ندارند.
از روش حذف برای محدود کردن گزینه‌های هر خانه خالی استفاده کنید. اگر عددی در یک ردیف، ستون یا زیرشبکه وجود داشته باشد، نمی‌تواند دوباره در آن منطقه قرار گیرد.

دنبال الگوها باشید:
الگوهایی مانند "جفت‌های برهنه" یا "تک‌عددهای پنهان" را شناسایی کنید که می‌توانند به حل پازل کمک کنند. جفت برهنه زمانی رخ می‌دهد که دو خانه در یک ردیف، ستون، یا زیرشبکه فقط دو عدد ممکن یکسان داشته باشند، به این معنی که این اعداد نمی‌توانند در جای دیگری در آن منطقه ظاهر شوند.

از حدس زدن پرهیز کنید:
سودوکو یک بازی منطقی است، نه حدسی. از حدس زدن اعداد خودداری کنید، زیرا این کار می‌تواند منجر به اشتباه شود. از استدلال منطقی برای تعیین جایگاه درست هر عدد استفاده کنید.

کار خود را بررسی کنید:
پس از پر کردن تمام خانه‌ها، هر ردیف، ستون، و زیرشبکه را دوباره بررسی کنید تا مطمئن شوید هر عدد از ۱ تا ۹ دقیقاً یک بار بدون تکرار ظاهر شده است.

پایان بازی:
بازی زمانی با موفقیت به پایان می‌رسد که کل جدول به درستی طبق قوانین پر شده باشد. اگر جدول پر شده و همه شرایط رعایت شده باشد، شما پازل سودوکو را حل کرده‌اید!

نکات برای بازی سودوکو:
با اعداد آسان شروع کنید: با پر کردن اعدادی که راحت‌تر هستند—آنهایی که بیشترین سرنخ‌ها را دارند—شروع کنید.
دنبال "تک‌عددی‌ها" باشید: خانه‌ای که فقط یک عدد ممکن دارد (بر اساس اعداد فعلی در ردیف، ستون، یا زیرشبکه آن) باید بلافاصله پر شود.
صبور و روشمند باشید: سودوکو نیاز به صبر و رویکردی روشمند دارد. عجله نکنید؛ هر حرکت را به دقت بررسی کنید تا از اشتباهات جلوگیری کنید.
سودوکو یک بازی تفکر منطقی، تشخیص الگوها و تمرکز است. این بازی یک چالش رضایت‌بخش ارائه می‌دهد که ذهن را تیز می‌کند و در عین حال احساس خوشایند دستاورد را پس از حل کردن به ارمغان می‌آورد.
''',
          AppTexts.battleshipGuide: '''
کشتی جنگی یک بازی کلاسیک استراتژی است که بین دو بازیکن انجام می‌شود. هر بازیکن تلاش می‌کند با حدس زدن مختصات کشتی‌های حریف روی یک جدول، ناوگان کشتی‌های او را غرق کند. این بازی شامل استدلال، استراتژی و کمی شانس است.

آماده‌سازی بازی:
کشتی‌ها:
هر بازیکن دارای یک ناوگان از 4 کشتی با اندازه‌های مختلف است:
ناو هواپیمابر (Carrier): ۵ خانه
رزم‌ناو (Battleship): ۴ خانه
ناوچه (Cruiser): ۳ خانه
زیردریایی (Submarine): ۳ خانه

قرار دادن کشتی‌ها:
بازیکنان کشتی‌های خود را به صورت افقی یا عمودی روی جدول خود قرار می‌دهند. کشتی‌ها نمی‌توانند روی هم قرار گیرند یا به صورت مورب گذاشته شوند.
قرار دادن کشتی‌ها باید به گونه‌ای باشد که حدس زدن برای حریف دشوارتر شود.

هدف بازی:
هدف این است که تمامی کشتی‌های حریف را پیش از آنکه او کشتی‌های شما را غرق کند، غرق کنید. کشتی زمانی غرق می‌شود که تمامی خانه‌های آن مورد اصابت قرار بگیرد.

قوانین بازی:
نوبت‌ها:
بازیکنان به نوبت مختصات یک خانه (مثلاً "B4") را برای حمله به یک خانه روی جدول حریف اعلام می‌کنند.

علامت‌گذاری اصابت‌ها و خطاها:
هر بازیکن از جدول دوم خود برای پیگیری اصابت‌ها و خطاهایش بر روی کشتی‌های حریف استفاده می‌کند.
اگر اصابت بود، آن خانه را با "O" علامت رده می شود تا نشان‌دهنده ضربه موفق باشد.
اگر خطا بود، آن را با "X" علامت زده می شود تا نشان دهد که کشتی‌ای در آنجا وجود ندارد.

غرق کردن کشتی‌ها:
هنگامی که تمام خانه‌های اشغال‌شده توسط یک کشتی مورد اصابت قرار گرفت، کشتی "غرق" محسوب می‌شود.
بازیکنی که کشتی حریف را غرق کرده باید مطلع شود و می‌تواند به حدس زدن ادامه دهد.

برنده شدن در بازی:
بازی تا زمانی ادامه می‌یابد که تمام کشتی‌های یک بازیکن غرق شوند. اولین بازیکنی که تمام کشتی‌های حریف خود را غرق کند، برنده بازی است.

استراتژی‌های بازی کشتی جنگی:
قرار دادن کشتی‌ها:
از قرار دادن کشتی‌ها به شکل قابل پیش‌بینی مانند در امتداد لبه‌ها یا تجمع آنها خودداری کنید.
از ترکیب قرار دادن افقی و عمودی استفاده کنید تا حریف را گیج کنید.

حدس زدن کشتی‌های حریف:
از مرکز شروع به هدف‌گیری کنید نه از لبه‌ها، جایی که احتمال قرارگیری کشتی‌ها کمتر است.
هنگامی که به یک خانه اصابت می‌کنید، از رویکردی روش‌مند برای پیدا کردن کل کشتی با هدف‌گیری خانه‌های مجاور استفاده کنید.

پیگیری الگوها:
شلیک‌های حریف را ثبت کنید تا بتوانید حدس بزنید که آنها کجا حمله کرده‌اند یا نکرده‌اند و به این ترتیب می‌توانید حدس بزنید که کشتی‌های شما کجا قرار دارند.
تطبیق استراتژی:

استراتژی خود را بر اساس الگوی حدس‌های حریف تنظیم کنید. اگر به نظر می‌رسد که آنها به صورت سیستماتیک مناطق را جستجو می‌کنند، در نظر بگیرید که ممکن است کجا را حدس بزنند و پاسخ‌های خود را برنامه‌ریزی کنید.

پایان بازی:
بازی زمانی به پایان می‌رسد که یک بازیکن با موفقیت هر چهار کشتی حریف را غرق کند. این بازیکن برنده اعلام می‌شود.

نکات برای بازیکنان جدید:
با شلیک‌های تصادفی شروع کنید: تا به درکی از مکان احتمالی کشتی‌های حریف برسید.
پیش‌بینی کنید: حرکت‌های حریف را بر اساس جایی که تاکنون حدس زده است پیش‌بینی کنید و بر اساس آن برنامه‌ریزی کنید.
آرام و استراتژیک بمانید: به یاد داشته باشید که این بازی، بازی استدلال و تفکر است، پس متمرکز ماندن به شما در پیروزی کمک خواهد کرد.
کشتی جنگی بازی استراتژی، برنامه‌ریزی دقیق، و کمی شانس است که هر حدس شما را به پیروزی نزدیک‌تر می‌کند یا ناوگان مخفی شما را در معرض شکست قرار می‌دهد.
''',
          AppTexts.boxFourGuide: '''
هدف:
هدف از این بازی استراتژیک اینست که تمامی خانه ها را ازآن خود کرده یا برای حریف خانه ای برای انتخاب نگذارید.

صفحه ی بازی"
اندازه شبکه: ۵x۵ که شامل ۲۵ خانه است.

وضعیت اولیه:
درابتدای بازی هر بازیکن یک خانه با عدد 3 در اختیار دارد.

نحوه ی انجام بازی :
هر خانه در شامل عددی از 1 تا ۳ است و همچنین هر خانه دارای رنگ بازیکنی است که آن را تصرف کرده است.
بازیکن در نوبت خود می تواند یکی از خانه هایی که به رنگ خود است را انتخاب کند.با ایت انخاب مقدار عدد آن خانه یک عدد زیاد میشود.
درصورتیکه عدد 4 شود، 4 خانه ی مجاور آن خانه به تصاحب بازیکن در می آید و مفدار هر کدام یک واحد زیاد می شوداین اتفاق می تواند به طور زنجیروار ادامه یابد..

شرایط پیروزی:
بازی زمانی به اتمام میرسد که بازیکنی دیگر خانه ای برای انتخاب نداشته باشد
''',
          AppTexts.backGammonGuide: '''
بازی تخته نرد یکی از قدیمی‌ترین بازی‌های تخته‌ای شناخته شده است که تاریخ آن به بیش از ۵۰۰۰ سال قبل برمی‌گردد. این بازی برای دو نفر طراحی شده و ترکیبی از شانس و مهارت را در بر دارد.

هدف:
 هدف بازی تخته نرد، حرکت دادن تمام مهره‌های خود به دور صفحه و برداشتن آن‌ها (حذف از صفحه) قبل از حریف است.

اجزای بازی
صفحه تخته نرد شامل ۲۴ مثلث باریک به نام "نقطه" است که در چهار بخش تقسیم شده‌اند. صفحه به دو نیمه تقسیم می‌شود که هر کدام دارای ۱۲ نقطه هستند. نقاط شماره‌گذاری از ۱ تا ۲۴ دارند.

مهره‌ها:
هر بازیکن ۱۵ مهره از یک رنگ دارد. این مهره‌ها طبق چیدمان اولیه روی صفحه قرار می‌گیرند.

تاس:
از دو تاس شش‌وجهی برای تعیین حرکت مهره‌ها استفاده می‌شود.

چیدمان اولیه
هر بازیکن با مهره‌های زیر شروع می‌کند:
۲ مهره روی نقطه ۲۴.
۵ مهره روی نقطه ۱۳.
۳ مهره روی نقطه ۸.
۵ مهره روی نقطه ۶.

جهت‌گیری صفحه:
صفحه هر بازیکن به گونه‌ای است که نقطه ۲۴ در گوشه پایین‌چپ آن‌ها قرار دارد و نقطه ۱ نزدیک‌ترین نقطه به آن‌ها است.

قوانین پایه
حرکت:
بازیکنان به نوبت دو تاس را می‌اندازند و مهره‌های خود را بر اساس اعداد تاس حرکت می‌دهند. هر تاس نمایانگر یک حرکت جداگانه است یا مجموع تاس‌ها می‌تواند برای یک حرکت واحد استفاده شود.
مهره‌ها می‌توانند به جلو از نقاط با شماره بالاتر به نقاط با شماره پایین‌تر حرکت کنند.

ضربه زدن و لکه‌دار کردن:
مهره می‌تواند روی نقطه‌ای که تنها یک مهره حریف (لکه) قرار دارد، قرار گیرد و آن مهره را به میله وسط صفحه بفرستد. حریف باید سپس مهره خود را دوباره وارد صفحه کند قبل از اینکه حرکات دیگری انجام دهد.
اگر مهره روی نقطه‌ای که توسط دو یا بیشتر از مهره‌های حریف اشغال شده است، قرار گیرد، حرکت قابل انجام نیست.

برداشتن مهره‌ها:
وقتی یک بازیکن تمام مهره‌های خود را به خانه خود (شش نقطه آخر نیمه خود) منتقل کند، می‌تواند شروع به برداشتن مهره‌ها کند. این شامل حذف مهره‌ها از صفحه بر اساس نتیجه تاس‌ها است.
اگر مهره‌هایی در میله یا در خانه حریف وجود داشته باشد، باید ابتدا وارد صفحه شوند قبل از برداشتن مهره‌ها.

پیروزی در بازی
اولین بازیکنی که تمام مهره‌های خود را بر می‌دارد برنده بازی است.

استراتژی و مهارت
مسدود کردن نقاط: ایجاد نقاط (اشغال شده با دو یا بیشتر مهره) برای مسدود کردن حرکت حریف.
ایمنی مهره‌ها: نگهداری مهره‌ها در موقعیت‌های امن برای جلوگیری از ضربه خوردن.
استراتژی دوبرابر کردن: تصمیم‌گیری درباره زمان استفاده از مکعب دوبرابر برای به حداکثر رساندن مزیت.
تخته نرد ترکیبی از برنامه‌ریزی استراتژیک و شانس است که هر بازی به چالش منحصر به فردی با توجه به نتیجه تاس‌ها و انتخاب‌های استراتژیک بازیکنان می‌پردازد.
''',
          AppTexts.tictactoeNarrative:
              'تخته به میدان نبردی از تنش خاموش بدل شده بود؛ هر "X" و "O" همچون سربازی برای تسلط می‌جنگید. در لحظه‌ای نفس‌گیر، نشان نهایی قرار گرفت و تعادل ظریف بازی در پیروزی و شکست فرو ریخت.',
          AppTexts.rpcNarrative:
              'در سکوت انتظار، دست‌ها با دقتی آموخته‌شده به حرکت درآمدند و هر حرکت، بی‌صدا به اعلام سرنوشت پرداخت. لحظه‌ی حقیقت با برش قاطع قیچی بر روی کاغذ فرا رسید و لبخند زودگذر پیروزی بر چهره‌ی یکی از بازیکنان نقش بست، در حالی که دیگری در سکوتی تأمل‌برانگیز شکست را پذیرفت.',
          AppTexts.millNarrative:
              'در میان شبکه پیچیده‌ی نُه‌مرد موریس، هر قرارگیری نغمه‌ای از زیرکی و گامی عمدی در نقشه‌ای بزرگ‌تر بود. با هم‌راستا شدن قطعات در یک دوز کامل، تنش خاموش بازی شکافت و جریان متغیر بخت نمایان شد. با هر قطعه‌ای که برداشته می‌شد، فضا با وزن پیروزی یا شکست قریب‌الوقوع سنگین‌تر می‌شد.',
          AppTexts.msweeperNarrative:
              'در هزارتوی پیکسل‌ها، هر کلیک گامی محتاطانه به سوی ناشناخته‌ها بود، رقصی با خطرات پنهان زیر سطح. اعداد به آرامی اسرار خطر و ایمنی را نجوا می‌کردند و دستان محتاط را در میان میدان مین‌ها راهنمایی می‌کردند. با هر مربع نمایان‌شده، تنش افزایش می‌یافت و پیروزی شکننده‌ای به صورت نخی نازک آویزان بود، در حالی که ماهیت واقعی صفحه به آرامی آشکار می‌شد.',
          AppTexts.mnumbersNarrative:
              'در ظرافت خاموش بازی، هر برگشت کارت همچون ضربه‌ای از قلم در پرتره‌ای لطیف از شانس و حافظه بود. شبکه، که روزی به شکل موزاییکی از رمز و راز بود، به آرامی اسرارش را آشکار کرد و جفت‌ها با پیروزی‌ای نرم پدیدار شدند. هر تطابق پیروزی‌ای نجواگونه بود، رقصی گذرا از استراتژی که زیبایی را در بافت بازی تنیده می‌کرد.',
          AppTexts.chessNarrative:
              'در تئاتر بزرگ شطرنج، هر حرکت همچون اعلامی خاموش از نیت است، باله‌ای استراتژیک بر ۶۴ مربع سرنوشت. برخورد قطعات مانند داستانی حماسی از فتح و زیرکی گشوده می‌شود، جایی که پیشروی هر پیاده و جهش هر اسب، قصه‌ای از آرزو و کشمکش را می‌سازد. با نزدیک شدن شاه‌ها به سرنوشت خویش، صفحه به صحنه‌ای از نبرد تبدیل می‌شود که در آن عقل و دوراندیشی به سلطنت می‌رسند.',
          AppTexts.checkersNarrative:
              'در رقصی بی‌زمان ، هر قطعه همچون سربازی است که در میدان نبردی از مربع‌های سیاه و سفید مأموریتی دارد. بازی همچون دوئلی خاموش از زیرکی‌ها آشکار می‌شود، جایی که هر پرش پیشروی جسورانه‌ای است و هر حرکت، ریسکی حساب‌شده. با ظهور شاهان و همگرایی خطوط، استراتژی به هنری بدل می‌شود و هر پیروزی، داستانی از صبر و دوراندیشی می‌گردد.',
          AppTexts.tenNarrative:
              'در بازی "ده بساز"، اعداد به ابزاری برای جادوی ریاضی بدل می‌شوند و هر عملگر پلی است میان منطق و خلاقیت. هر ترکیب از این چهار عدد، داستانی تازه روایت می‌کند، گویی ذهن در میان بی‌نهایت احتمالات به دنبال یافتن راهی به سوی عدد ۱۰ است. این بازی نبردی است میان هوش و شهود، جایی که خرد و خیال در هماهنگی با یکدیگر می‌رقصند.',
          AppTexts.othelloNarrative:
              'در بازی اتللو، هر مهره مانند سربازی است که در میدان نبرد ذهنی می‌جنگد؛ سیاهی و سفیدی در نبردی بی‌پایان بر سر سلطه و تعادل. هر حرکت، گامی به سوی پیروزی یا سقوط است، با استراتژی‌هایی که همچون امواج، یکدیگر را از میدان بیرون می‌رانند. این بازی، رقصی است بین خِرَد و شجاعت، جایی که هر تصمیم، سرنوشت را دگرگون می‌کند.',
          AppTexts.dotboxNarrative:
              'در بازی "نقطه و خط"، هر خطی که کشیده می‌شود، مسیری است به سوی تسخیر یا تسلیم. نقطه‌ها همچون ستارگانی خاموش‌اند که با پیوند خطوط، به جهان‌هایی کوچک تبدیل می‌شوند. این بازی، داستانی است از نقشه‌ها و فریب‌ها، جایی که هر حرکت می‌تواند به گسترش قلمرو یا از دست دادن همه چیز منجر شود.',
          AppTexts.yatzyNarrative:
              'در یاتزی، هر بار انداختن تاس، لحظه‌ای گذرا از شانس است که نجواهای تقدیر می‌تواند به پیروزی یا آزمون تبدیل شود. صدای تاس‌ها که به میز برخورد می‌کند، فصلی تازه در داستان پیوسته شانس و استراتژی می‌نگارد. در اینجا، هر انداختن وعده‌ای از شکوه یا شکست را به همراه دارد و با هر نوبت، تصویری از بخت را به تصویر می‌کشد.',
          AppTexts.fourInRowNarrative:
              'در بازی "چهار در ردیف"، هر دیسکی که به شبکه انداخته می‌شود، گامی است در رقصی پنهان و پر از استراتژی و شانس. رنگ‌های درخشان دیسک‌ها، نقشی از پیروزی‌ها و شکست‌ها می‌آفرینند، در حالی که بازیکنان در توازن میان تهاجم و دفاع، دنیای پیروزی‌های خود را می‌سازند. در این بازی از اتصالات و پیش‌بینی‌ها، هر حرکت نویدبخش شکوفایی استراتژیک یا طعم نزدیک‌ترین شکست را دارد.',
          AppTexts.sudokuNarrative:
              'در رقص ظریف سودوکو، هر عدد گامی به‌سوی تعادل است و هر خانه‌ی خالی، رمزی نهفته در انتظار کشف. این پازل به‌سان میدان نبردی پهناور از منطق می‌نماید، جایی که هر جای‌گذاری، حرکتی سنجیده در جنگی از خرد و تدبیر است. این‌جا، آشوب و نظم در سکوتی ژرف به هم می‌آویزند، تا جدول آهسته‌ آهسته نقش نهانی را برملا کند.',
          AppTexts.battleshipNarrative:
              'در پهنه وسیع جدول، کشتی جنگی به‌سان نبردی دریایی از خرد و استراتژی به نمایش درمی‌آید، جایی که هر مختصات نوید کشف یا شکست را می‌دهد. شلیک‌های خاموش در سراسر برد انعکاس می‌یابند، در حالی که بازیکنان در مه جنگ جستجو می‌کنند و به دنبال ناوگان پنهان حریف هستند. پیروزی نه از شانس، بلکه از هنر استراتژی و دقت در جای‌گذاری آشکار می‌شود.',
          AppTexts.boxFourNarrative:
              'در یک شبکه‌ی رنگین ۵x۵، اعداد به رقص در می‌آیند و رنگ‌ها شکوفا می‌شوند، هرگاه که هر قطعه به عدد چهار برسد و زنجیره‌ای از تغییرات را آغاز کند. با بازنشانی هر قطعه به صفر و رنگ‌آمیزی همسایگانش به رنگ انتخابی کاربر، شبکه به تابلوی زنده‌ای از استراتژی و شانس تبدیل می‌شود. در میان واکنش‌های زنجیره‌ای و الگوهای در حال تغییر، بازیکنان شاهکاری از رنگ و استراتژی خلق می‌کنند که هر حرکت، داستانی نوین را شکل می‌دهد.',
          AppTexts.backGammonNarrative:
              'در سحرگاه باستانی تخته نرد، تاس‌ها در رقصی بی‌پایان به گردش در می‌آیند و مهره‌ها در مسیر سرنوشت می‌رقصند. هر حرکت به نرمی پرده‌ای از پیروزی و شکست را می‌گشاید، نقشی از شانس و تدبیر بر جای می‌گذارد. این بازی کهن، با هر تاس، داستانی از نبردی سرشار از هوش و بخت را به تصویر می‌کشد و در تابلویش، اثراتی از پیروزی‌ها و ناکامی‌ها را به یادگار می‌گذارد.',
        },
        'en': {
          AppTexts.endGame: 'Game Finished',
          AppTexts.endRound: 'Round Finished',
          AppTexts.gameDrawed: 'Game Drawed',
          AppTexts.roundDrawed: 'This Round Drawed',
          AppTexts.youLoseGame: 'Unfortunately, you lost the game!',
          AppTexts.youLoseThisRound: 'You lost this round!',
          AppTexts.youWinGame: 'Congratulations, you won the game!',
          AppTexts.youWinThisRound: 'You won this round!',
          AppTexts.wanaSurrenderGame: '',
          AppTexts.enemySurrenderGame: '',
          AppTexts.youSurrenderGame: '',
          AppTexts.surrender: '',
          AppTexts.bombExploded: '',
          AppTexts.rollDice: '',
          AppTexts.showDice: '',
          AppTexts.playGame: '',
          AppTexts.kafehFekr: '',
          AppTexts.gameFinished: '',
          AppTexts.youOutOfMove: '',
          AppTexts.enemyOutOfMove: '',
          AppTexts.stopPrevoiusQueue: '',
          AppTexts.soon: '',
          AppTexts.outOfThisNumber: '',
          AppTexts.ok: 'Ok',
          AppTexts.accept: 'Accept',
          AppTexts.cancel: 'Cancel',
          AppTexts.wait: '',
          AppTexts.waitOpponent: '',
          AppTexts.selectOneOption: '',
          AppTexts.notYourTurn: "Not Your Turn!",
          AppTexts.cantSelect: "Cant Select Anymore!",
          AppTexts.selectedBefore: "This Piece Selected Before!",
          AppTexts.selectedWrongPlace: "",
          AppTexts.selectAllShips: "",
          AppTexts.cantRemoveYourPiece: "",
          AppTexts.cantRemoveThisPiece: "",
          AppTexts.cantSwapEnemyPiece: "",
          AppTexts.outOfDice: "",
          AppTexts.selectDiceFirst: "",
          AppTexts.bringInOutedPiece: "",
          AppTexts.selectNumber: "",
          AppTexts.playerThisRound: "",
          AppTexts.tictactoe: 'Tic-Tac-Toe',
          AppTexts.rpc: 'Rock-Paper-Scissors',
          AppTexts.mill: 'Mill',
          AppTexts.msweeper: 'Mine-Sweeper',
          AppTexts.mnumbers: 'Match-Numbers',
          AppTexts.chess: 'Chess',
          AppTexts.checkers: 'Checkers',
          AppTexts.ten: '10',
          AppTexts.othello: 'Othello',
          AppTexts.dotbox: 'DotBox',
          AppTexts.yatzy: 'Yatzy',
          AppTexts.fourInRow: 'Four-In-Row',
          AppTexts.sudoku: 'Sudoku',
          AppTexts.battleship: 'BattleShip',
          AppTexts.boxFour: 'BoxFour',
          AppTexts.backGammon: 'BackGammon',
          AppTexts.tictactoeGuide: '''
How to Play Tic-Tac-Toe:

Setup: Tic-tac-toe is played on a 3x3 grid. One player uses "X" and the other uses "O." Players take turns marking an empty square in the grid.

Objective: The goal is to be the first to align three of your marks (X or O) in a row, column, or diagonal.

Gameplay:

The first player (usually "X") begins by placing their mark in any of the empty squares.
The second player ("O") then places their mark in one of the remaining empty squares.
The game continues with players alternating turns, each trying to create a line of three marks while also blocking their opponent from doing the same.
Winning the Game: A player wins by placing three of their marks in a horizontal, vertical, or diagonal row. If all nine squares are filled without any player achieving this, the game is a draw (a "cat's game").

End of Game: Once a player achieves three in a row or all squares are filled, the game ends. Players can reset the grid and play again.''',
          AppTexts.rpcGuide: '''
How to Play Rock, Paper, Scissors:

Setup: Rock, Paper, Scissors is a simple hand game usually played between two people. Each player simultaneously forms one of three shapes with their hand: rock (a fist), paper (an open hand), or scissors (a fist with the index and middle fingers extended).

Objective: The objective is to choose a shape that defeats your opponent’s shape according to the rules.

Gameplay:

Both players count to three aloud and simultaneously reveal their chosen shape.
The outcome is determined by the following rules:
Rock crushes Scissors (Rock wins)
Scissors cuts Paper (Scissors wins)
Paper covers Rock (Paper wins)
If both players choose the same shape, the game is a tie and typically replayed.
Winning the Game: The player who selects the winning shape based on the rules above is the winner of that round. If playing multiple rounds, the player with the most wins at the end of the series is the overall winner.

End of Game: The game ends after a predetermined number of rounds, or when a player reaches a set number of wins. The players can then choose to start a new game or stop.''',
          AppTexts.millGuide: '''
How to Play Nine Men's Morris:

Setup:

Board: The game is played on a board with three concentric squares connected by lines, forming a grid with 24 intersections.
Pieces: Each player has 10 pieces of a distinct color (traditionally black or white).
Objective:

The goal is to form "mills" (three of your own pieces in a row along one of the lines) and to reduce your opponent’s pieces to two.
Gameplay:

Placement Phase:

Players take turns placing their pieces on empty intersections on the board.
The goal during this phase is to strategically position your pieces to form mills and block your opponent.
Movement Phase:

After all pieces are placed, players alternate turns moving their pieces.
A piece can move to any adjacent empty intersection along the lines connecting the squares.
Forming a mill allows you to remove one of your opponent’s pieces from the board.
Forming a Mill:

A mill is formed when you align three of your pieces in a row along one of the lines.
Each time you form a mill, you can remove one of your opponent’s pieces from the board.
Winning the Game:

The game ends when a player reduces their opponent to two pieces, making it impossible for the opponent to form any more mills or move pieces effectively.
Alternatively, if a player cannot make a legal move, the game ends in victory for the other player.
End of Game:

The game is won either by reducing the opponent to two pieces or by blocking their ability to make legal moves.''',
          AppTexts.msweeperGuide: '''
How to Play Minesweeper:

Setup:

Board: Minesweeper is played on a grid of squares, with the size varying depending on the difficulty level (e.g., 8x8, 16x16). Some squares contain hidden mines.
Objective: The goal is to clear the board by revealing all non-mine squares without detonating any mines.
Gameplay:

Initial Click: Begin by clicking any square on the grid. The first click is always safe and will reveal a section of the board.
Revealing Squares:
When you click on a square, one of three things can happen:
Empty Square: The square opens to reveal a number or a blank space. The number indicates how many mines are in the adjacent squares.
Numbered Square: Shows a number (1-8) indicating the count of adjacent mines. Use this information to deduce where mines might be.
Mine: If you click on a square containing a mine, the game ends in a loss.
Flagging Mines: Right-click (or use the flag tool) on a square to place a flag where you suspect a mine is located. This helps keep track of where mines might be and prevent accidental clicks.
Clearing the Board:
Continue revealing squares based on the numbers and flagged mines. Use logical deduction to determine which squares are safe to click.
If you reveal all non-mine squares, you win the game.
Winning and Losing:

Winning: The game is won when all non-mine squares are revealed, and no mines have been triggered.
Losing: The game is lost if you click on a mine, causing it to explode and end the game.
Advanced Strategies:

Pattern Recognition: Learn common patterns and strategies to identify safe squares more efficiently.
Risk Management: In situations with uncertain outcomes, weigh the risk of clicking certain squares based on available information.
By carefully uncovering squares and strategically flagging mines, you can navigate through the grid to achieve victory without detonating any hidden mines.''',
          AppTexts.mnumbersGuide: '''
How to Play Match the Numbers Game with 36 Pieces and 18 Numbers:

Setup:

Pieces: You have 36 pieces, each with a number on it. There are 18 unique numbers, with each number appearing on two pieces.
Objective: The goal is to match pairs of pieces that have the same number.
Gameplay:

Arranging the Pieces: Shuffle all 36 pieces and lay them face down in a grid formation (e.g., 6x6).
Taking Turns:
Players take turns flipping over two pieces at a time, trying to find a matching pair.
When a player flips two pieces, they reveal the numbers on those pieces.
Matching Pairs:
If the two pieces reveal the same number, the player keeps the pair and takes another turn.
If the numbers do not match, the pieces are turned face down again, and the turn passes to the next player.
Remembering Locations:
Players should remember the positions of numbers they have previously revealed to increase their chances of finding matches.
Winning the Game:

The game continues until all pairs have been matched and collected.
The player with the most pairs at the end of the game is the winner.
End of Game:

The game ends when all pieces have been successfully matched into pairs.
In case of a tie, where multiple players have the same number of pairs, the game can be declared a draw or played again to determine the winner.
By flipping pieces, remembering their positions, and strategically finding matches, players aim to collect the most pairs and win the game.''',
          AppTexts.chessGuide: '''
How to Play Chess:

1. Setup:

Board: Chess is played on an 8x8 grid of alternating light and dark squares. The board is positioned so that each player has a light square in the bottom-right corner.
Pieces: Each player starts with 16 pieces: 1 king, 1 queen, 2 rooks, 2 knights, 2 bishops, and 8 pawns.
Back Row (from left to right): Rook, Knight, Bishop, Queen, King, Bishop, Knight, Rook.
Front Row: All 8 pawns.
2. Objective:

The main goal is to checkmate your opponent’s king, which means putting the king in a position where it is under threat of capture and cannot escape.
3. Basic Rules and Moves:

King: Moves one square in any direction—horizontally, vertically, or diagonally.
Queen: Moves any number of squares in any direction—horizontally, vertically, or diagonally.
Rook: Moves any number of squares horizontally or vertically.
Bishop: Moves any number of squares diagonally.
Knight: Moves in an L-shape: two squares in one direction and then one square perpendicular to that direction. Knights are the only pieces that can jump over other pieces.
Pawn: Moves forward one square but captures diagonally. On its first move, a pawn can move forward two squares. Pawns can be promoted to any piece (except a king) upon reaching the opposite end of the board.
4. Special Moves:

Castling: A move involving the king and either rook. The king moves two squares towards a rook, and that rook moves to the square next to the king. Conditions: neither the king nor the rook has previously moved, the squares between them must be empty, and the king cannot be in check or move through squares attacked by the opponent.
En Passant: A special pawn capture that occurs when a pawn moves two squares forward from its starting position and lands beside an opponent’s pawn. The opponent can capture the pawn “en passant” as if the first pawn had only moved one square forward.
Pawn Promotion: When a pawn reaches the opposite end of the board, it can be promoted to any other piece (except a king), usually a queen.
5. Check and Checkmate:

Check: When a king is under immediate threat of capture. The player must make a move to remove the threat.
Checkmate: When a king is in check and no legal move can remove the threat. The game ends with the checkmated player losing.
6. Draws:

Stalemate: Occurs when a player, on their turn, has no legal moves and their king is not in check. This results in a draw.
Threefold Repetition: A draw can occur if the same position is repeated three times with the same player to move.
Fifty-Move Rule: A draw can be claimed if no capture or pawn move has been made in the last fifty moves.
7. End of Game:

The game ends when one player checkmates the opponent’s king, the opponent resigns, or a draw condition is met.
In chess, strategy, foresight, and the ability to anticipate your opponent's moves are crucial for success.''',
          AppTexts.checkersGuide: '''
How to Play Checkers:

1. Setup:

Board: Checkers is played on an 8x8 board with alternating dark and light squares. Only the dark squares are used for movement and capturing.
Pieces: Each player starts with 12 pieces, usually referred to as "men." One player uses the dark pieces, and the other uses the light pieces.
Initial Placement: Place the pieces on the three rows closest to each player. Each player’s pieces occupy the dark squares of these rows.
2. Objective:

The goal of Checkers is to capture all of the opponent’s pieces or block them so they cannot make a legal move.
3. Basic Rules and Moves:

Movement:
Men: Move diagonally forward one square at a time on the dark squares.
King: A piece becomes a king when it reaches the last row on the opponent’s side. Kings can move diagonally forward and backward, covering any number of squares.
Capturing:
Basic Capture: To capture an opponent's piece, jump over it diagonally into an empty square directly beyond it. The captured piece is removed from the board.
Multiple Captures: If a piece can make another capture after the first, it must continue capturing in the same turn.
Promotion: When a man reaches the last row on the opponent’s side, it is promoted to a king and is crowned by placing another piece on top of it.
4. Special Rules:

Double Jump: If a piece can make multiple captures in one turn, it must continue capturing.
No Jump Over Own Pieces: A player cannot jump over their own pieces.
5. Winning the Game:

The game is won if a player captures all of the opponent’s pieces or blocks them so they cannot make any legal moves.
6. Draws:

Stalemate: If neither player can make a legal move and no pieces are left to capture, the game is declared a draw.
Insufficient Material: If neither player has enough pieces to force a win, the game may be declared a draw.
7. End of Game:

The game ends when one player has captured all of the opponent’s pieces or when neither player can make a legal move, resulting in a draw.
In Checkers, strategic movement and careful planning are key, as players must anticipate their opponent’s moves while working to outmaneuver them.''',
          AppTexts.tenGuide: '''
How to Play the "Make Ten" Game:

The "Make Ten" game is a mathematical puzzle where players are given four numbers and must use mathematical operators (addition, subtraction, multiplication, and division) to manipulate those numbers to reach the value of 10. The game requires creative thinking, understanding of math operations, and sometimes a bit of trial and error.

Rules of the Game:
Objective: Use all four numbers and any combination of mathematical operators (+, −, ×, ÷) to form an expression that equals exactly 10.

Numbers: The player is provided with four numbers. For example: [2, 3, 5, 7].

Operators: You can use any of the four basic arithmetic operations:

Addition (+)
Subtraction (−)
Multiplication (×)
Division (÷)
Usage of Numbers:

Each of the four numbers must be used exactly once.
The order in which you use the numbers can be rearranged.
Formation of Expressions:

Players can combine the numbers and operators in any way they choose. For example: (2 + 3) × (7 - 5).
Parentheses can be used to control the order of operations.
No Concatenation:

You cannot concatenate numbers to form a new number (e.g., combining 2 and 3 to make 23).
Valid Result: The final expression must result in exactly 10. Approximations or decimals are not allowed; the solution must be a precise integer value.

Example of Play:
Example Numbers: [2, 3, 5, 7]

Step 1: Look for combinations of numbers that could potentially add, subtract, multiply, or divide to make 10.
For example, start with 2 and 3. Adding them gives 5.

Step 2: Consider the next number. If we add 5 (from the initial set), it makes 10.
But we still have the number 7 to use. Try (7 - 5) to make 2.

Step 3: Combine the steps to form the complete expression:
(2 + 3) + (7 - 5) = 10.

Thus, the final expression is:
(
2
+
3
)
+
(
7
−
5
)
=
10.
(2+3)+(7−5)=10.

Tips and Strategies:
Think Ahead: Consider the effects of each operator and the order of operations. Multiplication and division have a stronger influence on the result than addition and subtraction.

Experiment with Different Combinations: If one approach doesn’t work, rearrange the numbers or try a different combination of operations.

Use Parentheses Wisely: Parentheses help control the order of operations and can help group numbers to achieve the desired result.

Practice with Different Sets: The more you practice, the more familiar you will become with recognizing potential combinations that lead to the solution.

End of Game:
The game ends when the player successfully creates an expression that equals 10 using all four numbers. Players can compete to see who can solve the puzzle the fastest or who can find the most unique solutions.
This game is a fun way to sharpen mathematical skills, boost problem-solving abilities, and enjoy a mental challenge!''',
          AppTexts.othelloGuide: '''
Othello, also known as Reversi, is a two-player strategy game where the objective is to have the majority of your color's discs on the board by the end of the game. The game is played on an 8x8 grid using double-sided discs (black on one side, white on the other).

Game Setup:
Board: The game is played on an 8x8 square board.
Pieces: Each player uses 32 discs. One side of each disc is black, and the other side is white.
Starting Position: Place two black discs on D5 and E4 and two white discs on D4 and E5 in the center of the board.
Objective:
The goal is to finish the game with the majority of discs showing your color.
Gameplay Rules:
Turns:

Players take turns placing a disc of their color on the board.
The black player always goes first.
Outflanking:

A valid move must outflank one or more of the opponent’s discs.
Outflanking means placing a disc so that it sandwiches a line of the opponent’s discs between two of your discs in a straight line (horizontal, vertical, or diagonal).
Flipping Discs:

After placing a disc, all of the opponent’s outflanked discs are flipped to the player's color.
Multiple lines of discs can be flipped in a single move.
Valid Moves:

If a player has no valid moves that result in a flip, they must pass their turn.
If neither player can move, the game ends.
End of the Game:
The game ends when neither player can make a valid move, usually when the board is full.
The player with the most discs of their color on the board wins.
Basic Strategies:
Control Corners: Secure corner positions as they are permanent and cannot be flipped.
Avoid Giving Away Corners: Be cautious of moves that allow the opponent easy access to corners.
Edge Control: Controlling edges can provide strategic advantages and limit the opponent’s moves.
Othello is a game of tactics and planning, where every move can turn the tide. It combines simplicity with deep strategic depth, making it a classic game for all ages.''',
          AppTexts.dotboxGuide: '''
Dot and Boxes (also known simply as Dots and Boxes) is a classic pencil-and-paper game for two players. The objective is to complete more boxes than your opponent by connecting dots with lines.

Game Setup:
Grid Setup:

Draw a grid of dots on a piece of paper. Common grid sizes are 5x5 or 6x6, but the grid can be any size you like.
Each dot represents a vertex where lines (edges) can be drawn to form squares (boxes).
Players:

Two players take turns. You can use different colored pens or pencils to distinguish the players' moves.
Objective:
The goal is to complete more boxes than your opponent by drawing the fourth side of a 1x1 box.
Gameplay Rules:
Drawing Lines:

Players take turns drawing a single horizontal or vertical line between two adjacent dots.
Lines must be drawn on the grid and connect only two adjacent dots.
Completing a Box:

When a player draws a line that completes the fourth side of a 1x1 box, they "capture" that box.
The player then writes their initial or marks the box with their color and gets an extra turn.
Extra Turns:

If completing a box results in the possibility to complete another box, the player continues to draw lines until no further boxes can be completed.
Strategic Play:

Players aim to avoid setting up the opponent to complete a box.
The key is to create opportunities where you can capture multiple boxes in one turn.
Ending the Game:

The game ends when all possible lines have been drawn, and all boxes are completed.
Winning the Game:
The player with the most completed boxes wins the game.
Basic Strategies:
Avoid the Third Side: Try not to draw the third side of a box, as it allows the opponent to complete it on their next turn.

Create Chains: Look for opportunities to create chains of boxes that you can capture in one go.

Force Your Opponent: Set up moves that force your opponent to give you multiple boxes on your turn.

Dot and Boxes is a game of careful planning and strategy, where each line drawn has the potential to turn the game. With its simple rules and deep tactics, it is a timeless game that challenges the mind and entertains players of all ages.''',
          AppTexts.yatzyGuide: '''
Yahtzee is a popular dice game that combines luck and strategy. The game is played with five dice and a scorecard, where players aim to roll specific combinations to earn the highest possible score.

Game Setup:
Players: Yahtzee can be played by two or more players.
Equipment: Each player needs a scorecard and a pen. The game uses five standard six-sided dice and a cup for rolling.
Objective:
The goal is to score the most points by rolling specific combinations with the dice over thirteen rounds.
Gameplay Rules:
Rolling the Dice:

On each turn, a player can roll the five dice up to three times.
After each roll, the player may choose to set aside any dice they want to keep and re-roll the remaining dice. The player can do this up to two more times (for a total of three rolls per turn).
Choosing a Category:

After the third roll, or if the player decides to stop earlier, they must choose one of the categories on the scorecard to record their score.
Categories are divided into two sections: the Upper Section and the Lower Section.
Scoring in the Upper Section:

The upper section consists of scoring combinations for each die face (ones, twos, threes, etc.).
Players score the total of the corresponding number rolled (e.g., if you roll three fives, you score 15 in the "Fives" category).
If a player scores at least 63 points in the upper section, they receive a 35-point bonus.
Scoring in the Lower Section:

The lower section includes various combinations such as:
Three of a Kind: Three dice showing the same number. Score is the total of all dice.
Four of a Kind: Four dice showing the same number. Score is the total of all dice.
Full House: Three of a kind and a pair. Scores 25 points.
Small Straight: Four consecutive numbers (e.g., 1-2-3-4). Scores 30 points.
Large Straight: Five consecutive numbers (e.g., 2-3-4-5-6). Scores 40 points.
Yahtzee: Five of a kind. Scores 50 points.
Chance: Any combination. Scores the total of all dice.
Yahtzee Bonuses:

If a player rolls more than one Yahtzee (five of a kind) during the game, they receive a bonus of 100 points for each additional Yahtzee, provided they have already scored in the Yahtzee category.
End of the Game:

The game ends after thirteen rounds, when all categories on the scorecard have been filled.
Players add up their scores from both the upper and lower sections to get their final total.
Winning the Game:
The player with the highest total score at the end of the game wins.
Strategies:
Balance Risk and Reward: Decide when to go for high-risk combinations like Yahtzee versus safer options like Chance.

Upper Section Bonus: Aim to secure the 35-point bonus by prioritizing the upper section early in the game.

Flexible Strategy: Be prepared to adapt your strategy based on what you roll and what categories are left.

Yahtzee is a game of chance, choice, and strategy, offering excitement with every roll and challenging players to think ahead and maximize their scores.''',
          AppTexts.fourInRowGuide: '''
Connect Four is a two-player connection game where the goal is to be the first to connect four of your own discs in a row, either vertically, horizontally, or diagonally. The game is played on a vertical grid and is known for its simplicity and strategic depth.

Game Setup:
Players: Two players compete against each other.
Equipment:
A vertical grid (usually 6 rows by 7 columns).
Two sets of discs, one for each player (typically one set is red and the other is yellow).
Objective:
The objective is to be the first player to align four of your own discs in a row, either vertically, horizontally, or diagonally.
Gameplay Rules:
Taking Turns:

Players take turns dropping one of their discs into one of the seven columns of the grid.
The disc will fall straight down into the lowest available space within the chosen column.
Disc Placement:

Each column can hold a maximum of six discs.
Discs must fall to the lowest available spot in the chosen column.
Winning the Game:

The first player to connect four of their own discs in a row, either horizontally, vertically, or diagonally, wins the game.
The game ends when a player achieves this connection or when all columns are filled and no player has won (resulting in a draw).
Blocking and Strategy:

Players should aim to create their own connections of four discs while also blocking their opponent's attempts to do the same.
Strategic play involves both offensive moves to create a connection and defensive moves to prevent the opponent from winning.
Ending the Game:
The game ends when a player connects four discs in a row or when all spaces in the grid are filled, leading to a draw if no player has achieved four in a row.
Basic Strategies:
Control the Center: Try to place your discs in the center columns, as it offers more opportunities for creating connections.
Watch for Opportunities: Look for chances to create multiple winning connections simultaneously.
Block Opponent: Always be on the lookout for potential winning moves by your opponent and block them if necessary.
Connect Four is a game of tactical depth, where each move can potentially lead to victory or defeat. Its simple rules combined with strategic possibilities make it a timeless classic enjoyed by players of all ages.''',
          AppTexts.sudokuGuide: '''
Sudoku is a popular logic-based number puzzle that involves filling a 9x9 grid with digits. The goal is to fill the grid so that each column, each row, and each of the nine 3x3 subgrids (also called "boxes") contains all of the digits from 1 to 9 without repeating any numbers.

Game Setup:
The Sudoku grid consists of 81 cells arranged in a 9x9 format.
The grid is further divided into nine 3x3 subgrids.
Some cells are pre-filled with numbers, which serve as clues to solve the puzzle. The difficulty of the puzzle depends on how many numbers are pre-filled and where they are placed.
Objective:
The objective of Sudoku is to fill the entire 9x9 grid with digits from 1 to 9. Each digit must appear only once in each row, column, and 3x3 subgrid.
Gameplay Rules:
Filling the Grid:

Start by looking at the grid and identifying rows, columns, or subgrids where some numbers are already filled in. These are your clues.
Use logical reasoning to figure out which numbers can go in the empty cells while adhering to the following rules:
Rule 1: Each number from 1 to 9 must appear exactly once in each row.
Rule 2: Each number from 1 to 9 must appear exactly once in each column.
Rule 3: Each number from 1 to 9 must appear exactly once in each 3x3 subgrid.
Using Elimination:

Examine each row, column, and subgrid to determine which numbers are missing.
Use the process of elimination to narrow down the possibilities for each empty cell. If a number already exists in a row, column, or subgrid, it cannot be placed again in that area.
Pencil in Possibilities:

For more challenging puzzles, it can be helpful to "pencil in" potential numbers in the margins of the cells. This means writing down all possible numbers that could fit in each empty cell.
As you progress and fill in more cells, you'll be able to eliminate some of these possibilities.
Look for Patterns:

Identify patterns such as "naked pairs" or "hidden singles" that can help solve the puzzle. A naked pair occurs when two cells in a row, column, or subgrid have the same two possible numbers, which means those numbers cannot appear anywhere else in that area.
Avoid Guessing:

Sudoku is a game of logic, not guesswork. Avoid guessing numbers, as this can lead to mistakes. Use deduction and logical reasoning to determine the correct placement for each number.
Check Your Work:

After filling in all the cells, double-check each row, column, and subgrid to ensure that every number from 1 to 9 appears exactly once without any repetition.
Ending the Game:
The game is completed successfully when the entire grid is correctly filled according to the rules. If the grid is filled and all the conditions are met, you’ve solved the Sudoku puzzle!
Tips for Playing Sudoku:
Start with the Easy Numbers: Begin by filling in the numbers that are easiest to place—those that have the most clues already filled in.
Look for Lone Rangers: A cell that can contain only one possible number (based on the current numbers in its row, column, or subgrid) is called a "lone ranger" and should be filled in immediately.
Stay Patient and Methodical: Sudoku requires patience and a methodical approach. Don't rush; carefully consider each move to avoid mistakes.
Sudoku is a game of logical thinking, pattern recognition, and concentration. It offers a satisfying challenge that sharpens the mind while providing a rewarding sense of achievement upon completion.''',
          AppTexts.battleshipGuide: '''
Battleship is a classic strategy game played between two players, where each tries to sink the other's fleet of ships by guessing the coordinates of the opponent's ships on a grid. The game involves deduction, strategy, and a bit of luck.

Game Setup:
Game Boards:

Each player has two 10x10 grids: one for their ships and one to mark their guesses on the opponent’s grid.
The rows are labeled with numbers (1 to 10), and the columns are labeled with letters (A to J).
Ships:

Each player has a fleet of 4 ships of different sizes:
Carrier: 5 cells
Battleship: 4 cells
Cruiser: 3 cells
Destroyer: 2 cells
Placing Ships:

Players place their ships on their own grid, either horizontally or vertically. Ships cannot overlap or be placed diagonally.
The placement of ships should be strategic to avoid easy guessing by the opponent.
Objective:
The goal is to sink all of your opponent's ships before they sink yours. A ship is sunk when all its cells are hit.
Gameplay Rules:
Taking Turns:

Players take turns calling out a coordinate (e.g., "B4") to attack a cell on the opponent’s grid.
The opponent checks their grid and announces whether it’s a "hit" or a "miss."
Marking Hits and Misses:

Each player uses their second grid to keep track of their hits and misses on the opponent’s ships.
If a hit is announced, mark that cell on the grid with a red peg or "O" to show a successful strike.
If it’s a miss, mark it with a white peg or "X" to indicate no ship was there.
Sinking Ships:

When all the cells occupied by a ship have been hit, the ship is considered "sunk."
The player who sunk the ship should be informed, and they may continue guessing.
Winning the Game:

The game continues until all the ships of one player are sunk. The first player to sink all of their opponent's ships wins the game.
Strategies for Playing Battleship:
Ship Placement:

Avoid predictable placements like lining ships up along the edges or clustering them together.
Use a mix of horizontal and vertical placements to confuse your opponent.
Guessing Opponent's Ships:

Start by targeting central areas rather than the edges, where ships are less likely to be placed.
Once you get a hit, use a methodical approach to find the entire ship by targeting adjacent cells.
Tracking Patterns:

Keep a record of your opponent’s shots to deduce where they have or have not yet attacked, giving clues on where they suspect your ships are placed.
Adapting Strategy:

Adapt your strategy based on the opponent’s guessing pattern. If they seem to be systematically searching areas, consider where they might guess next and plan your responses.
Ending the Game:
The game ends when one player successfully sinks all four ships of the opponent. This player is declared the winner.
Tips for New Players:
Start with Random Shots: To get a sense of where your opponent’s ships might be.
Think Ahead: Predict your opponent's moves based on where they’ve guessed and plan accordingly.
Stay Calm and Strategic: Remember, it’s a game of deduction, so staying focused will help you win.
Battleship is a game of strategy, careful planning, and a bit of luck, where each guess could bring you closer to victory or expose your hidden fleet to defeat.''',
          AppTexts.boxFourGuide: '''
Objective:
The goal of the game is to strategically manipulate pieces on a 5x5 grid to achieve a desired color pattern or configuration. Each piece interacts with its neighbors according to specific rules.

Grid Setup:

Grid Size: 5x5 grid, consisting of 25 cells.
Initial State: Each cell can contain a number (typically from 0 to 3) and may have a color or be empty at the start.
Gameplay Mechanics:

Pieces and Numbers:

Each cell on the grid has a number ranging from 0 to 3.
Cells can also be colored or uncolored.
Triggering a Piece:

When a cell's number reaches 4, it triggers a special action:
Color Change: The piece’s color changes to the user's assigned color.
Neighbor Increment: Each adjacent cell (top, bottom, left, right) has its number increased by 1.
Self Reset: The piece that triggered the action resets to 0 and its color is removed, reverting it to an uncolored state.
Neighbor Impact:

After a piece triggers, its neighboring cells' numbers increase by 1. This may cause neighboring cells to reach 4 in subsequent moves, potentially triggering their own actions.
Chain Reactions:

The game often involves strategic planning to create chain reactions. A piece's activation can cause its neighbors to activate, leading to further changes and potentially complex sequences of events.
Winning Conditions:

The game can have different objectives based on the version or level:
Color Pattern: Achieve a specific color pattern across the grid.
Score Target: Reach a specific score or configuration within a certain number of moves.
Complete the Grid: Fill the grid with the user's color or achieve a predefined configuration of colors.
Strategy Tips:

Plan Moves: Carefully plan each move to ensure that triggering a piece will help achieve the desired color pattern or configuration.
Manage Reactions: Consider how activating one piece will affect its neighbors and create beneficial chain reactions.
Use Colors Wisely: Strategically use the color changes to achieve the game’s objectives and manage the grid’s overall state.''',
          AppTexts.backGammonGuide: '''
Backgammon is one of the oldest known board games, with a history spanning over 5,000 years. It is a strategic game for two players involving luck and skill. Here’s a comprehensive description of the game:

Overview
Objective:
The goal of Backgammon is to move all of your checkers around the board and bear them off (remove them from the board) before your opponent does.

Game Components
Board:

The Backgammon board consists of 24 narrow triangles called "points," arranged in four quadrants. The board is divided into two halves, each containing 12 points. The points alternate in color and are numbered from 1 to 24.
Checkers:

Each player has 15 checkers of one color (usually white or black). These checkers are placed on the board according to the initial setup.
Dice:

Two six-sided dice are used to determine the movement of checkers. There is also a “doubling cube” with values of 2, 4, 8, 16, 32, and 64, used to raise the stakes of the game.
Dice Cup (optional):

A cup used to shake the dice, which helps ensure randomness.
Setup
Initial Positioning:

Each player starts with their checkers placed as follows:
2 checkers on the 24-point.
5 checkers on the 13-point.
3 checkers on the 8-point.
5 checkers on the 6-point.
Board Orientation:

Each player’s board is oriented so that their 24-point is in their bottom-left corner, with the 1-point being the closest to them.
Basic Rules
Movement:

Players take turns rolling two dice and moving their checkers based on the numbers rolled. Each die represents a separate move, or the total of the dice can be used for a single move.
Checkers can move forward from higher-numbered points to lower-numbered points.
Hitting and Blotting:

A checker can land on a point occupied by a single opponent’s checker (a “blot”), sending that checker to the bar in the middle of the board. The opponent must then re-enter their checker onto the board before making any other moves.
If a checker lands on a point already occupied by two or more of the opponent’s checkers, the move is blocked and cannot be made.
Bearing Off:

Once a player has moved all their checkers into their home board (the last six points of their half), they can begin bearing off. This involves removing checkers from the board according to the dice roll.
If there are checkers on the bar or in the opponent’s home board, they must be re-entered before bearing off.
Doubling Cube
Purpose:

The doubling cube allows players to increase the stakes of the game. Either player can propose doubling the stakes at any time during the game.
Acceptance or Refusal:

The opponent must accept the doubled stakes to continue playing or forfeit the game. If accepted, the cube is turned to the next value and given to the player who accepted.
Winning the Game
Winning by Bearing Off:

The first player to bear off all their checkers wins the game.
Gammon and Backgammon:

A Gammon occurs if a player bears off all their checkers before the opponent has borne off any. This results in a double win (2 points).
A Backgammon occurs if a player bears off all their checkers while the opponent still has checkers in the winner’s home board or on the bar. This results in a triple win (3 points).
Strategy and Skill
Blocking Points: Forming points (occupied with two or more checkers) to block your opponent’s movement.
Checkers Safety: Keeping checkers in safe positions to avoid being hit.
Doubling Strategy: Deciding when to use the doubling cube effectively to maximize your advantage.
Backgammon is a blend of strategic planning and luck, with each game offering a unique challenge based on the dice rolls and the players’ strategic choices.''',
          AppTexts.tictactoeNarrative:
              'The board became a battlefield of silent tension, each X and O a soldier vying for dominance. In a breathless moment, the final mark was placed, and the delicate balance of the game shattered into victory and defeat.',
          AppTexts.rpcNarrative:
              'In the hush of anticipation, hands moved with practiced precision, each gesture a silent declaration of fate. The moment of truth arrived as scissors snipped through paper with a crisp finality. A fleeting smile of triumph crossed one player’s face, while the other absorbed the loss in reflective silence.',
          AppTexts.millNarrative:
              "Amid the intricate lattice of Nine Men's Morris, each placement was a whisper of cunning, a deliberate step in a grander scheme. As the pieces aligned in a perfect mill, the game’s silent tension cracked open, revealing the shifting tides of fortune. With each removed piece, the air thickened with the weight of impending victory or defeat.",
          AppTexts.msweeperNarrative:
              "In the labyrinth of pixels, each click was a tentative step into the unknown, a dance with hidden dangers beneath the surface. Numbers whispered secrets of peril and safety, guiding cautious hands through a minefield of choices. With every revealed square, the tension mounted, a fragile victory hanging by a thread as the board's true nature slowly unfolded.",
          AppTexts.mnumbersNarrative:
              'In the quiet elegance of the game, each flipped card was a brushstroke in a delicate portrait of chance and memory. The grid, once a mosaic of mystery, slowly revealed its secrets as pairs emerged with a soft triumph. Each match was a whispered victory, a fleeting dance of strategy that wove beauty into the fabric of the game.',
          AppTexts.chessNarrative:
              'In the grand theater of chess, each move is a silent declaration of intent, a strategic ballet on the 64 squares of fate. The clash of pieces unfolds like an epic tale of conquest and cunning, where every pawn’s advance and knight’s leap weave a story of ambition and struggle. As the kings edge closer to their fates, the board transforms into a battlefield where intellect and foresight reign supreme.',
          AppTexts.checkersNarrative:
              'In the timeless dance of checkers, each piece is a soldier on a mission across a battlefield of black and white squares. The game unfolds like a quiet duel of wits, where each jump is a daring advance and every move a calculated risk. As kings emerge and lines converge, strategy becomes an art, and every victory, a tale of patience and foresight.',
          AppTexts.tenNarrative:
              'In the game of "Make Ten," numbers become tools for mathematical magic, and each operator is a bridge between logic and creativity. Every combination of the four numbers tells a new story, as the mind navigates through endless possibilities to reach the number 10. It is a battle of wit and intuition, where reason and imagination dance in harmony.',
          AppTexts.othelloNarrative:
              'In the game of Othello, each piece is like a soldier fighting in a mental battlefield; black and white locked in an endless struggle for dominance and balance. Every move is a step toward victory or defeat, with strategies that, like waves, push each other off the board. This game is a dance between wisdom and courage, where every decision reshapes destiny.',
          AppTexts.dotboxNarrative: '',
          AppTexts.yatzyNarrative:
              "In Yahtzee, each roll of the dice is a fleeting moment of chance, where destiny's whisper can turn into triumph or trial. The clatter of dice against the table writes a new chapter in the ongoing saga of luck and strategy. Here, every throw holds the promise of glory or defeat, painting a portrait of fortune with each turn.",
          AppTexts.fourInRowNarrative:
              'In "Connect Four," each disc dropped into the grid is a step in a grand, silent dance of strategy and chance. The vibrant colors of the discs weave a tapestry of triumphs and defeats, as players build their visions of victory amidst the delicate balance of offense and defense. In this game of connections and anticipation, every move holds the promise of a strategic breakthrough or the sting of a near miss.',
          AppTexts.sudokuNarrative:
              'In the intricate dance of Sudoku, every number is a step toward balance, every blank a mystery waiting to be unveiled. The puzzle stretches like a vast battlefield of logic, where each placement is a calculated move in a war of wits. Here, chaos and order clash silently, as the grid slowly reveals a hidden tapestry of perfect symmetry.',
          AppTexts.battleshipNarrative:
              "In the vast expanse of the grid, Battleship unfolds like a naval duel of wits, where each coordinate holds the promise of discovery or defeat. Silent salvos echo across the board, as players navigate the fog of war, seeking their opponent's hidden fleet. Victory emerges not from chance, but from the artful strategy of placement and precision.",
          AppTexts.boxFourNarrative:
              'In a vibrant 5x5 grid, numbers dance and colors bloom as each piece reaches the critical four, igniting a cascade of transformation. With each piece resetting to zero and painting its neighbors with the user’s chosen hue, the grid evolves into a living mosaic of strategy and chance. Amidst the chain reactions and shifting patterns, players craft a masterpiece of color and strategy, where every move shapes the unfolding story.',
          AppTexts.backGammonNarrative:
              'In the ancient dawn of backgammon, dice spin endlessly, and checkers dance along the path of destiny. Each move gently unveils a tableau of victory and defeat, leaving traces of chance and strategy. This timeless game, with every roll, paints a story of battles rich in wit and fortune, leaving a legacy of triumphs and failures on its board.',
          AppTexts.tictactoeGameGuide: '',
          AppTexts.rpcGameGuide: '',
          AppTexts.millGameGuide: '',
          AppTexts.msweeperGameGuide: '',
          AppTexts.mnumbersGameGuide: '',
          AppTexts.chessGameGuide: '',
          AppTexts.checkersGameGuide: '',
          AppTexts.tenGameGuide: '',
          AppTexts.othelloGameGuide: '',
          AppTexts.dotboxGameGuide: '',
          AppTexts.yatzyGameGuide: '',
          AppTexts.fourInRowGameGuide: '',
          AppTexts.sudokuGameGuide: '',
          AppTexts.battleshipGameGuide: '',
          AppTexts.boxFourGameGuide: '',
          AppTexts.backGammonGameGuide: '',
        },
      };
}
