List<Map<String, String>> citizenRoles = [
  {
    "name": "شهروند ساده",
    "description":
        "نقشی بدون توانایی خاص که در فاز روز با تحلیل و رأی‌گیری به شناسایی مافیا کمک می‌کند."
  },
  {
    "name": "دکتر",
    "description":
        "هر شب می‌تواند یک نفر را از حمله مافیا نجات دهد. در برخی نسخه‌ها، دکتر می‌تواند در دو شب اول دو نفر را نجات دهد."
  },
  {
    "name": "کارآگاه",
    "description":
        "هر شب می‌تواند استعلام مافیا بودن یک بازیکن را از گرداننده بگیرد. استعلام پدرخوانده همیشه منفی است."
  },
  {
    "name": "تک‌ تیرانداز",
    "description":
        "هر شب می‌تواند به یک نفر شلیک کند. اگر هدف مافیا باشد، او را حذف می‌کند؛ در غیر این صورت خودش از بازی حذف می‌شود."
  },
  {
    "name": "قاضی",
    "description":
        "یک‌بار در طول بازی می‌تواند از خروج یکی از بازیکنان جلوگیری کند، مگر اینکه خودش در معرض خروج باشد."
  },
  {
    "name": "کشیش",
    "description":
        "هر شب می‌تواند یک بازیکن را از حالت سکوت خارج کند، در صورتی که توسط ناتاشا سایلنت شده باشد."
  },
  {
    "name": "روان‌ پزشک",
    "description":
        "دو بار در طول بازی می‌تواند قدرت مکالمه بازیکنی را بابت روان‌درمانی از او بگیرد."
  },
  {
    "name": "خبرنگار",
    "description":
        "پس از مذاکره مافیا، می‌تواند استعلام بگیرد که آیا بازیکنی مورد مذاکره قرار گرفته است یا خیر."
  },
  {
    "name": "زره‌پوش",
    "description":
        "در شب با هر تعداد شات نامیرا است، اما در روز یک زره در مقابل رأی دارد. پس از از بین رفتن زره، به شهروند ساده تبدیل می‌شود."
  },
  {
    "name": "جان‌سخت",
    "description":
        "با شلیک اول از سوی مافیا کشته نمی‌شود و از آن بی‌خبر است. می‌تواند دو بار استعلام وضعیت بازیکنان حذف‌شده را بگیرد."
  },
  {
    "name": "نگهبان",
    "description":
        "هر شب می‌تواند از یک بازیکن در برابر گروگان‌گیری محافظت کند. اگر نگهبان کشته شود، به شهروند ساده تبدیل می‌شود."
  },
  {
    "name": "فرمانده",
    "description":
        "پس از شلیک تک‌تیرانداز، می‌تواند شلیک را لغو کند. در صورت لغو، تیر به تک‌تیرانداز برمی‌گردد."
  },
  {
    "name": "فدایی",
    "description":
        "می‌تواند خودش را فدای بازیکنی کند که در معرض خروج است یا توسط تروریست هدف قرار گرفته است."
  },
  {
    "name": "تفنگدار",
    "description":
        "هر شب می‌تواند دو تفنگ به بازیکنان بدهد. تفنگ‌ها می‌توانند جنگی یا مشقی باشند."
  },
  {
    "name": "جادوگر",
    "description": "هر شب می‌تواند نقش یک بازیکن را از گرداننده بپرسد."
  },
  {
    "name": "وکیل",
    "description": "می‌تواند در طول بازی از خروج یک بازیکن جلوگیری کند."
  },
  {
    "name": "شهردار",
    "description":
        "می‌تواند در هر روز یکی از دو قابلیت را استفاده کند: لغو دور دوم رأی‌گیری یا حذف قطعی یک بازیکن بدون رأی‌گیری."
  },
  {
    "name": "محافظ",
    "description": "هر شب می‌تواند از یک بازیکن در برابر حمله مافیا محافظت کند."
  },
  {
    "name": "دندان‌پزشک",
    "description":
        "هر شب می‌تواند یک بازیکن را برای یک شب از صحبت کردن محروم کند."
  },
  {
    "name": "هکر",
    "description":
        "در شب دوم بازی، یک لیست سه‌نفره به گرداننده می‌دهد. اگر حداقل یکی از آن‌ها مافیا باشد، گرداننده اعلام می‌کند که لیست خطرناک است."
  },
  {
    "name": "نانوا",
    "description":
        "در صورت حذف شدن، یک نان به بازیکنی می‌دهد که می‌تواند از آن برای یک بار نجات از خروج استفاده کند."
  },
  {
    "name": "گورکن",
    "description": "می‌تواند نقش بازیکنان حذف‌شده را از گرداننده بپرسد."
  },
  {
    "name": "زندان‌بان",
    "description":
        "هر شب می‌تواند یک بازیکن را زندانی کند، که در آن شب نمی‌تواند از نقش خود استفاده کند."
  },
  {
    "name": "تکاور",
    "description":
        "در صورت هدف قرار گرفتن توسط مافیا، می‌تواند یک بار به یکی از آن‌ها شلیک کند."
  },
  {
    "name": "ناقل",
    "description": "می‌تواند نقش خود را به بازیکن دیگری منتقل کند."
  },
  {
    "name": "بمب‌گذار",
    "description": "در صورت حذف شدن، بازیکنی را با خود از بازی خارج می‌کند."
  },
  {
    "name": "پیک مخفی",
    "description": "می‌تواند پیام‌هایی بین بازیکنان رد و بدل کند."
  },
  {
    "name": "ساقی",
    "description":
        "می‌تواند هر شب یک بازیکن را مست کند، که در آن شب نمی‌تواند از نقش خود استفاده کند."
  },
  {
    "name": "قهرمان",
    "description":
        "در صورت حذف شدن، می‌تواند یک بازیکن را با خود از بازی خارج کند."
  },
  {
    "name": "سم‌ساز",
    "description":
        "هر شب می‌تواند یک بازیکن را مسموم کند. بازیکن مسموم‌شده در شب بعد از بازی خارج می‌شود."
  },
];
