List<Map<String, String>> independentRoles = [
  {
    "name": "جوکر",
    "description":
        "هدفش این است که در فاز روز با رأی‌گیری از بازی حذف شود تا به پیروزی برسد. در برابر شلیک‌های شب مصون است."
  },
  {
    "name": "قاتل سریالی",
    "description":
        "هر شب می‌تواند یک بازیکن را حذف کند. هدفش حذف تمام بازیکنان دیگر و پیروزی به‌تنهایی است."
  },
  {
    "name": "گرگ‌ نما",
    "description":
        "هر سه شب یک‌بار می‌تواند یک بازیکن را به گرگینه تبدیل کند. هدفش تبدیل بیش از نیمی از بازیکنان به گرگینه و پیروزی است."
  },
  {
    "name": "عشق‌کش",
    "description":
        "می‌تواند دو بازیکن را عاشق کند. اگر یکی از آن‌ها حذف شود، دیگری نیز از بازی خارج می‌شود."
  },
  {
    "name": "خودفروخته",
    "description":
        "می‌تواند با هر دو تیم مذاکره کند و به آن‌ها بپیوندد. هدفش بقا تا پایان بازی است."
  },
  {
    "name": "جادوگر",
    "description":
        "هر شب می‌تواند یک بازیکن را افسون کند، که در آن شب نمی‌تواند از نقش خود استفاده کند."
  },
  {
    "name": "بی‌طرف",
    "description": "نقشی بدون وابستگی به تیم خاصی. هدفش بقا تا پایان بازی است."
  },
  {
    "name": "فراماسون",
    "description":
        "می‌تواند با بازیکنان مذاکره کند و آن‌ها را به تیم خود جذب کند."
  },
  {
    "name": "بیمار روانی",
    "description":
        "هر شب می‌تواند یک بازیکن را روان‌پریش کند، که در آن شب نمی‌تواند از نقش خود استفاده کند."
  },
  {
    "name": "شیاد",
    "description": "می‌تواند نقش خود را به بازیکن دیگری منتقل کند."
  }
];
