List<Map<String, String>> mafiaRoles = [
  {
    "name": "پدرخوانده",
    "description":
        "رهبر تیم مافیا که هر شب تصمیم نهایی برای شلیک را می‌گیرد. استعلام او برای کارآگاه همیشه منفی است."
  },
  {
    "name": "مافیای ساده",
    "description":
        "در شب همراه تیم مافیا بیدار می‌شود و می‌تواند یک نفر را برای شات شب پیشنهاد دهد، اما تصمیم نهایی با پدرخوانده است."
  },
  {
    "name": "ناتاشا",
    "description":
        "هر شب یک بازیکن را سایلنت می‌کند. بازیکن سایلنت‌شده نمی‌تواند صحبت کند یا رأی بدهد."
  },
  {
    "name": "تروریست",
    "description":
        "در صورت حذف شدن در فاز روز، می‌تواند یک بازیکن را با خود از بازی خارج کند."
  },
  {
    "name": "بازجو",
    "description": "هر شب می‌تواند نقش یک بازیکن را از گرداننده بپرسد."
  },
  {
    "name": "مذاکره‌کننده",
    "description":
        "می‌تواند با بازیکنان مذاکره کند و آن‌ها را به تیم مافیا جذب کند."
  },
  {
    "name": "ناتو",
    "description":
        "می‌تواند نقش یک بازیکن را حدس بزند. در صورت حدس درست، بازیکن از بازی خارج می‌شود."
  },
  {
    "name": "خرابکار",
    "description":
        "هر شب می‌تواند دو بازیکن را خرابکاری کند. در صورت استفاده از تفنگ جنگی توسط بازیکن خرابکاری‌شده، تیر به خودش برمی‌گردد."
  },
  {
    "name": "یاکوزا",
    "description": "می‌تواند یک بازیکن را به تیم مافیا منتقل کند."
  },
  {
    "name": "افسونگر",
    "description":
        "هر شب می‌تواند یک بازیکن را افسون کند، که در آن شب نمی‌تواند از نقش خود استفاده کند."
  },
  {
    "name": "دکتر لکتر",
    "description":
        "هر شب می‌تواند یکی از اعضای مافیا را از حمله نجات دهد. می‌تواند خود را فقط یک بار نجات دهد."
  },
  {
    "name": "مرد قوی",
    "description":
        "در شب با هر تعداد شات نامیرا است، اما در روز یک زره در مقابل رأی دارد. پس از از بین رفتن زره، به مافیای ساده تبدیل می‌شود."
  },
  {
    "name": "آمپول‌زن",
    "description":
        "هر شب می‌تواند یک بازیکن را با آمپول مسموم کند. بازیکن مسموم‌شده در شب بعد از بازی خارج می‌شود."
  },
  {
    "name": "گروگان‌گیر",
    "description":
        "هر شب می‌تواند یک بازیکن را گروگان بگیرد، که در آن شب نمی‌تواند از نقش خود استفاده کند."
  },
  {
    "name": "شب‌خسب",
    "description":
        "هر شب می‌تواند یک بازیکن را به خواب ببرد، که در آن شب نمی‌تواند از نقش خود استفاده کند."
  },
  {
    "name": "نقاب‌دار",
    "description": "می‌تواند نقش خود را به بازیکن دیگری منتقل کند."
  },
  {
    "name": "جاسوس",
    "description":
        "می‌تواند هر شب یک بازیکن را بررسی کند و اطلاعاتی درباره نقش او به دست آورد."
  },
  {
    "name": "دزد",
    "description": "می‌تواند هر شب نقش یک بازیکن را بدزدد و از آن استفاده کند."
  },
  {
    "name": "بادیگارد مافیا",
    "description": "می‌تواند از اعضای مافیا در برابر حملات محافظت کند."
  },
  {
    "name": "روان‌پریش",
    "description":
        "هر شب می‌تواند یک بازیکن را روان‌پریش کند، که در آن شب نمی‌تواند از نقش خود استفاده کند."
  },
  {
    "name": "مزدور",
    "description":
        "می‌تواند با بازیکنان مذاکره کند و آن‌ها را به تیم مافیا جذب کند."
  },
  {
    "name": "سلطان",
    "description": "رهبر قدرتمند تیم مافیا با توانایی‌های ویژه در کنترل بازی."
  },
  {
    "name": "چریک",
    "description": "می‌تواند هر شب یک بازیکن را به صورت مخفیانه حذف کند."
  },
  {
    "name": "خبرچین",
    "description":
        "می‌تواند اطلاعاتی درباره نقش‌های بازیکنان به دست آورد و به تیم مافیا منتقل کند."
  },
  {
    "name": "شکنجه‌گر",
    "description":
        "می‌تواند هر شب یک بازیکن را شکنجه کند تا اطلاعاتی از او به دست آورد."
  },
  {
    "name": "آلوده‌کننده",
    "description":
        "می‌تواند هر شب یک بازیکن را آلوده کند، که در آن شب نمی‌تواند از نقش خود استفاده کند."
  },
  {
    "name": "شاه‌کش",
    "description":
        "دو بار در طول بازی می‌تواند نقش یک بازیکن را حدس بزند. در صورت حدس درست، بازیکن از بازی خارج می‌شود."
  },
  {
    "name": "معشوقه",
    "description":
        "در صورت حذف پدرخوانده، می‌تواند دو بازیکن را با خود از بازی خارج کند."
  },
  {
    "name": "روانکاو",
    "description":
        "می‌تواند هر شب یک بازیکن را روانکاوی کند و اطلاعاتی درباره نقش او به دست آورد."
  }
];
